src/c程序设计.org
#+OPTONS: ^:nil
* 顺序程序设计
** 常量
1. 整型常量
   #+BEGIN_EXAMPLE
   1000, 0, -345 ...
   #+END_EXAMPLE
2. 实型常量
   #+BEGIN_EXAMPLE
   十进制小数形式: 123.456, 0.345, -56.79 ...
   指数形式: 12.34e3, -346.87e-25
   #+END_EXAMPLE
3. 字符常量
   #+BEGIN_EXAMPLE
   普通字符: 'a', 'Z', '3', '?' ...
   转义字符: '\n', '\t' ...
   #+END_EXAMPLE
4. 字符串常量
   #+BEGIN_EXAMPLE
   "boy", "123", ...
   #+END_EXAMPLE
5. 符号常量
   #+BEGIN_SRC c
   # define PI 3.1416
   #+END_SRC

** 变量
变量代表一个有名字的,具有特定属性的存储单元,它用来存放数据.
在程序运行期间,变量的值是可以改变的.
** 常变量
#+BEGIN_SRC c
const int a=3;
/*
  常变量和符号常量的区别:
  常变量有类型,占用存储单元;符号常量没有类型,不占用存储单元
  事实上,符号常量用于代表一个字符串,在预编译时进行字符替换,
  在预编译后,就不存在了
*/
#+END_SRC
** 标识符
用于对变量,符号常量名,函数,数组,类型等命名的字符序列称为标识符.
标识符只能由字母,数字和下划线组成,第一个字符必须是字母或下划线.
** 数据类型
所谓类型,就是对数据分配存储单元的安排,不同类型,其存储单元长度和数据存储形式不同
** 整型数据
1. int
   #+BEGIN_EXAMPLE
   存储长度: 依赖编译器,一般是一个机器字长

   存储形式: 用整数的补码形式存放
   #+END_EXAMPLE
   #+BEGIN_EXAMPLE
   一个正数的补码是此数的二进制形式
   一个负数的补码是其绝对值的二进制按位取反再加1
   #+END_EXAMPLE
2. short int
   #+BEGIN_EXAMPLE
   存储长度: 依赖编译器,不长于int的存储长度

   存储形式: 同int
   #+END_EXAMPLE
3. long int
   #+BEGIN_EXAMPLE
   存储长度: 依赖编译器,不短于int的存储长度

   存储形式: 同int
   #+END_EXAMPLE
4. long long int
   #+BEGIN_EXAMPLE
   存储长度: 依赖编译器,不短于long int的存储长度

   存储形式: 同int
   #+END_EXAMPLE
5. char
   #+BEGIN_EXAMPLE
   存储长度: 1字节

   存储形式: ASCII字符集的基本集包括了127个字符,用7个二进位就可以表示,
            字节中的第一位置为0
   #+END_EXAMPLE
5. signed && unsigned + [整型类型]
   #+BEGIN_EXAMPLE
   有符号整型存储单元中最高位代表符号(0正1负)

   无符号整型全部二进位都用作存放数值本身,
   无符号的char类型的第一位不再固定为0,多出来的空间可以存储扩展字符集

   默认是有符号类型
   #+END_EXAMPLE
** 浮点型数据
规范化指数形式:指数形式表示法中小数点前的数字为0,小数点后第一位数字不为0的表示形式
1. float
  #+BEGIN_EXAMPLE
  存储长度: 4字节

  存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=32. m和n由编译器决定
           小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
  #+END_EXAMPLE
2. double
  #+BEGIN_EXAMPLE
  存储长度: 8字节

  存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=64. m和n由编译器决定
           小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
  #+END_EXAMPLE
3. long double
  #+BEGIN_EXAMPLE
  存储长度: 依赖编译器

  存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=128. m和n由编译器决定
           小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
  #+END_EXAMPLE
** 常量的类型
+ 字符常量
  只要是单引号括起的单个字符或转移字符就是字符常量
+ 整形常量
  不带小数点的数值是整形常量.
  根据数值所在的范围确定具体的整形类型,规则 *依赖编译器* .
+ 浮点型常量
  以小数形式或指数形式出现的实数是浮点型常量,按 *双精度* 处理
** 运算符和表达式
*** 注意事项
+ 两个实数相除的结果是双精度实数
+ 两个整数相除的结果为整数,舍去小数部分.
  如果有一个为负值,舍入的方向 *依赖编译器* ,多数编译器采取"向零取整"规则
+ %的操作正能是整数
+ 赋值运算符"="是右结合性
  #+BEGIN_SRC c
  a=b=c; //先把c的值赋给b,再把b的值赋给a
  #+END_SRC
#+BEGIN_EXAMPLE
问题

i+++j的结果会怎样?
#+END_EXAMPLE
*** 不同类型混合运算
1. float型和double型,将float型转换为double型,结果是double型
2. int型和double型,将int型转换为double型,结果是double型
3. char性和int型,把字符的ASCII码与int型数据进行运算
** c语句
*** 赋值语句
#+BEGIN_SRC c
一些例子

a=(b=5)        //b=5,a=5; 整个表达式的值是5

a=(b=4)+(c=6)  //b等于4,c等于6,a等于10; 整个表达式的值是10

(a=b)=3*4      //error (a=b)是赋值表达式,不能做左值
#+END_SRC
