html/c程序设计.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>c程序设计</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="c程序设计"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-07T11:06+0800"/>
<meta name="author" content="王超"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">c程序设计</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 顺序程序设计</a>
<ul>
<li><a href="#sec-1-1">1.1 常量</a></li>
<li><a href="#sec-1-2">1.2 变量</a></li>
<li><a href="#sec-1-3">1.3 常变量</a></li>
<li><a href="#sec-1-4">1.4 标识符</a></li>
<li><a href="#sec-1-5">1.5 数据类型</a></li>
<li><a href="#sec-1-6">1.6 整型数据</a></li>
<li><a href="#sec-1-7">1.7 浮点型数据</a></li>
<li><a href="#sec-1-8">1.8 常量的类型</a></li>
<li><a href="#sec-1-9">1.9 运算符和表达式</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1 注意事项</a></li>
<li><a href="#sec-1-9-2">1.9.2 不同类型混合运算</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10 c语句</a>
<ul>
<li><a href="#sec-1-10-1">1.10.1 赋值语句</a></li>
</ul>
</li>
<li><a href="#sec-1-11">1.11 数据的输入输出</a></li>
</ul>
</li>
<li><a href="#sec-2">2 选择结构程序设计</a>
<ul>
<li><a href="#sec-2-1">2.1 if语句</a></li>
<li><a href="#sec-2-2">2.2 关系运算符和关系表达式</a></li>
<li><a href="#sec-2-3">2.3 逻辑运算符和逻辑表达式</a></li>
<li><a href="#sec-2-4">2.4 switch语句</a></li>
</ul>
</li>
<li><a href="#sec-3">3 循环结构程序设计</a>
<ul>
<li><a href="#sec-3-1">3.1 while语句</a></li>
<li><a href="#sec-3-2">3.2 do-while语句</a></li>
<li><a href="#sec-3-3">3.3 for语句</a></li>
<li><a href="#sec-3-4">3.4 改变循环执行的状态</a></li>
</ul>
</li>
<li><a href="#sec-4">4 数组</a>
<ul>
<li><a href="#sec-4-1">4.1 一维数组</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 定义</a></li>
<li><a href="#sec-4-1-2">4.1.2 引用数组元素</a></li>
<li><a href="#sec-4-1-3">4.1.3 初始化</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 二维数组</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 定义</a></li>
<li><a href="#sec-4-2-2">4.2.2 引用数组元素</a></li>
<li><a href="#sec-4-2-3">4.2.3 初始化</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 字符数组</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 定义</a></li>
<li><a href="#sec-4-3-2">4.3.2 初始化</a></li>
<li><a href="#sec-4-3-3">4.3.3 字符串</a></li>
<li><a href="#sec-4-3-4">4.3.4 字符数组的输入输出</a></li>
<li><a href="#sec-4-3-5">4.3.5 字符串处理函数</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 函数</a>
<ul>
<li><a href="#sec-5-1">5.1 定义函数</a></li>
<li><a href="#sec-5-2">5.2 调用函数</a></li>
<li><a href="#sec-5-3">5.3 函数声明</a></li>
<li><a href="#sec-5-4">5.4 函数的嵌套调用</a></li>
<li><a href="#sec-5-5">5.5 函数的递归调用</a></li>
<li><a href="#sec-5-6">5.6 数组作为函数参数</a>
<ul>
<li><a href="#sec-5-6-1">5.6.1 多维数组</a></li>
</ul>
</li>
<li><a href="#sec-5-7">5.7 局部变量和全局变量</a>
<ul>
<li><a href="#sec-5-7-1">5.7.1 局部变量</a></li>
<li><a href="#sec-5-7-2">5.7.2 全局变量</a></li>
</ul>
</li>
<li><a href="#sec-5-8">5.8 变量的存储方式和生存期</a></li>
<li><a href="#sec-5-9">5.9 变量的声明和定义</a></li>
<li><a href="#sec-5-10">5.10 内部函数和外部函数</a></li>
</ul>
</li>
<li><a href="#sec-6">6 指针</a>
<ul>
<li><a href="#sec-6-1">6.1 指针变量</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 定义指针变量</a></li>
<li><a href="#sec-6-1-2">6.1.2 引用指针变量</a></li>
<li><a href="#sec-6-1-3">6.1.3 指针变量作函数参数</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 通过指针引用数组</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 数组元素的指针</a></li>
<li><a href="#sec-6-2-2">6.2.2 指针的运算</a></li>
<li><a href="#sec-6-2-3">6.2.3 通过指针引用数组</a></li>
<li><a href="#sec-6-2-4">6.2.4 数组名作函数参数</a></li>
<li><a href="#sec-6-2-5">6.2.5 通过指针引用多维数组</a></li>
<li><a href="#sec-6-2-6">6.2.6 指针与数组的区别</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3 通过指针引用字符串</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1 字符串的引用方式</a></li>
<li><a href="#sec-6-3-2">6.3.2 字符指针变量与其他类型指针变量的区别</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4 指向函数的指针</a></li>
<li><a href="#sec-6-5">6.5 返回指针值的函数</a></li>
<li><a href="#sec-6-6">6.6 指针数组和多重指针</a>
<ul>
<li><a href="#sec-6-6-1">6.6.1 指针数组</a></li>
<li><a href="#sec-6-6-2">6.6.2 指向指针的指针</a></li>
<li><a href="#sec-6-6-3">6.6.3 指针数组作main函数的形参</a></li>
</ul>
</li>
<li><a href="#sec-6-7">6.7 动态内存分配</a>
<ul>
<li><a href="#sec-6-7-1">6.7.1 建立内存动态分配</a></li>
<li><a href="#sec-6-7-2">6.7.2 void指针类型</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 用户自己建立数据类型</a>
<ul>
<li><a href="#sec-7-1">7.1 定义和使用结构体变量</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 定义结构体类型变量</a></li>
<li><a href="#sec-7-1-2">7.1.2 初始化和引用结构体变量</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2 结构体数组</a></li>
<li><a href="#sec-7-3">7.3 结构体指针</a></li>
<li><a href="#sec-7-4">7.4 共用体类型</a></li>
<li><a href="#sec-7-5">7.5 使用枚举类型</a></li>
<li><a href="#sec-7-6">7.6 用typedef声明新类型名</a></li>
</ul>
</li>
<li><a href="#sec-8">8 文件的输入输出</a>
<ul>
<li><a href="#sec-8-1">8.1 c文件基础</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1 文件流</a></li>
<li><a href="#sec-8-1-2">8.1.2 ASCII文件和二进制文件</a></li>
<li><a href="#sec-8-1-3">8.1.3 文件缓冲区</a></li>
<li><a href="#sec-8-1-4">8.1.4 文件类型指针</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2 打开与关闭文件</a></li>
<li><a href="#sec-8-3">8.3 顺序读写数据文件</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1 读写字符</a></li>
<li><a href="#sec-8-3-2">8.3.2 读写字符串</a></li>
<li><a href="#sec-8-3-3">8.3.3 用格式化方式读写文件</a></li>
<li><a href="#sec-8-3-4">8.3.4 用二进制方式读写文件</a></li>
</ul>
</li>
<li><a href="#sec-8-4">8.4 随机读写数据文件</a>
<ul>
<li><a href="#sec-8-4-1">8.4.1 rewind</a></li>
<li><a href="#sec-8-4-2">8.4.2 fseek</a></li>
<li><a href="#sec-8-4-3">8.4.3 ftell</a></li>
</ul>
</li>
<li><a href="#sec-8-5">8.5 文件读写出错检测</a>
<ul>
<li><a href="#sec-8-5-1">8.5.1 ferror</a></li>
<li><a href="#sec-8-5-2">8.5.2 clearerr</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 顺序程序设计</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 常量</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>整型常量



<pre class="example">1000, 0, -345 ...
</pre>

</li>
<li>实型常量



<pre class="example">十进制小数形式: 123.456, 0.345, -56.79 ...
指数形式: 12.34e3, -346.87e-25
</pre>

</li>
<li>字符常量



<pre class="example">普通字符: 'a', 'Z', '3', '?' ...
转义字符: '\n', '\t' ...
</pre>

</li>
<li>字符串常量



<pre class="example">"boy", "123", ...
</pre>

</li>
<li>符号常量



<pre class="src src-c"><span style="color: #483d8b;"># define</span> <span style="color: #a0522d;">PI</span> 3.1416
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 变量</h3>
<div class="outline-text-3" id="text-1-2">

<p>变量代表一个有名字的,具有特定属性的存储单元,它用来存放数据.
在程序运行期间,变量的值是可以改变的.
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 常变量</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-c"><span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>=3;
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  &#24120;&#21464;&#37327;&#21644;&#31526;&#21495;&#24120;&#37327;&#30340;&#21306;&#21035;:</span>
<span style="color: #b22222;">  &#24120;&#21464;&#37327;&#26377;&#31867;&#22411;,&#21344;&#29992;&#23384;&#20648;&#21333;&#20803;;&#31526;&#21495;&#24120;&#37327;&#27809;&#26377;&#31867;&#22411;,&#19981;&#21344;&#29992;&#23384;&#20648;&#21333;&#20803;</span>
<span style="color: #b22222;">  &#20107;&#23454;&#19978;,&#31526;&#21495;&#24120;&#37327;&#29992;&#20110;&#20195;&#34920;&#19968;&#20010;&#23383;&#31526;&#20018;,&#22312;&#39044;&#32534;&#35793;&#26102;&#36827;&#34892;&#23383;&#31526;&#26367;&#25442;,</span>
<span style="color: #b22222;">  &#22312;&#39044;&#32534;&#35793;&#21518;,&#23601;&#19981;&#23384;&#22312;&#20102;</span>
<span style="color: #b22222;">*/</span>
</pre>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 标识符</h3>
<div class="outline-text-3" id="text-1-4">

<p>用于对变量,符号常量名,函数,数组,类型等命名的字符序列称为标识符.
标识符只能由字母,数字和下划线组成,第一个字符必须是字母或下划线.
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 数据类型</h3>
<div class="outline-text-3" id="text-1-5">

<p>所谓类型,就是对数据分配存储单元的安排,不同类型,其存储单元长度和数据存储形式不同
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 整型数据</h3>
<div class="outline-text-3" id="text-1-6">

<ol>
<li>int



<pre class="example">存储长度: 依赖编译器,一般是一个机器字长

存储形式: 用整数的补码形式存放
</pre>


<pre class="example">一个正数的补码是此数的二进制形式
一个负数的补码是其绝对值的二进制按位取反再加1
</pre>

</li>
<li>short int



<pre class="example">存储长度: 依赖编译器,不长于int的存储长度

存储形式: 同int
</pre>

</li>
<li>long int



<pre class="example">存储长度: 依赖编译器,不短于int的存储长度

存储形式: 同int
</pre>

</li>
<li>long long int



<pre class="example">存储长度: 依赖编译器,不短于long int的存储长度

存储形式: 同int
</pre>

</li>
<li>char



<pre class="example">存储长度: 1字节

存储形式: ASCII字符集的基本集包括了127个字符,用7个二进位就可以表示,
         字节中的第一位置为0
</pre>

</li>
<li>signed &amp;&amp; unsigned + [整型类型]



<pre class="example">有符号整型存储单元中最高位代表符号(0正1负)

无符号整型全部二进位都用作存放数值本身,
无符号的char类型的第一位不再固定为0,多出来的空间可以存储扩展字符集

默认是有符号类型
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 浮点型数据</h3>
<div class="outline-text-3" id="text-1-7">

<p>规范化指数形式:指数形式表示法中小数点前的数字为0,小数点后第一位数字不为0的表示形式
</p><ol>
<li>float



<pre class="example">存储长度: 4字节

存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=32. m和n由编译器决定
         小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
</pre>

</li>
<li>double



<pre class="example">存储长度: 8字节

存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=64. m和n由编译器决定
         小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
</pre>

</li>
<li>long double



<pre class="example">存储长度: 依赖编译器

存储形式: n位表示小数部分(包括符号) m位表示指数部分 m+n=128. m和n由编译器决定
         小数部分占位越多,精度越高;指数部分占位越多,表示范围越大
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 常量的类型</h3>
<div class="outline-text-3" id="text-1-8">

<ul>
<li>字符常量
  只要是单引号括起的单个字符或转移字符就是字符常量
</li>
<li>整形常量
  不带小数点的数值是整形常量.
  根据数值所在的范围确定具体的整形类型,规则 <b>依赖编译器</b> .
</li>
<li>浮点型常量
  以小数形式或指数形式出现的实数是浮点型常量,按 <b>双精度</b> 处理
</li>
</ul>

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 运算符和表达式</h3>
<div class="outline-text-3" id="text-1-9">


</div>

<div id="outline-container-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> 注意事项</h4>
<div class="outline-text-4" id="text-1-9-1">

<ul>
<li>两个实数相除的结果是双精度实数
</li>
<li>两个整数相除的结果为整数,舍去小数部分.
  如果有一个为负值,舍入的方向 <b>依赖编译器</b> ,多数编译器采取"向零取整"规则
</li>
<li>%的操作正能是整数
</li>
<li>赋值运算符"="是右结合性



<pre class="src src-c">a=b=c; <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20808;&#25226;c&#30340;&#20540;&#36171;&#32473;b,&#20877;&#25226;b&#30340;&#20540;&#36171;&#32473;a</span>
</pre>

</li>
</ul>




<pre class="example">问题

i+++j的结果会怎样?
</pre>

</div>

</div>

<div id="outline-container-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> 不同类型混合运算</h4>
<div class="outline-text-4" id="text-1-9-2">

<ol>
<li>float型和double型,将float型转换为double型,结果是double型
</li>
<li>int型和double型,将int型转换为double型,结果是double型
</li>
<li>char性和int型,把字符的ASCII码与int型数据进行运算
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> c语句</h3>
<div class="outline-text-3" id="text-1-10">


</div>

<div id="outline-container-1-10-1" class="outline-4">
<h4 id="sec-1-10-1"><span class="section-number-4">1.10.1</span> 赋值语句</h4>
<div class="outline-text-4" id="text-1-10-1">




<pre class="src src-c"><span style="color: #228b22;">&#19968;&#20123;&#20363;&#23376;</span>

<span style="color: #a0522d;">a</span>=(b=5)        <span style="color: #b22222;">//</span><span style="color: #b22222;">b=5,a=5; &#25972;&#20010;&#34920;&#36798;&#24335;&#30340;&#20540;&#26159;5</span>

a=(b=4)+(c=6)  <span style="color: #b22222;">//</span><span style="color: #b22222;">b&#31561;&#20110;4,c&#31561;&#20110;6,a&#31561;&#20110;10; &#25972;&#20010;&#34920;&#36798;&#24335;&#30340;&#20540;&#26159;10</span>

(a=b)=3*4      <span style="color: #b22222;">//</span><span style="color: #b22222;">error (a=b)&#26159;&#36171;&#20540;&#34920;&#36798;&#24335;,&#19981;&#33021;&#20570;&#24038;&#20540;</span>
</pre>

<ul>
<li id="sec-1-10-1-1">赋值过程中的类型转换<br/>
<ol>
