src/c程序设计.org
**** 赋值过程中的类型转换
1. 浮点型赋给整型: 先舍去小数部分,然后赋给整型变量
2. 整型赋给浮点型: 数值不变,但以浮点数形式存储
3. double型赋给float型: 截取6~7位有效数字.若值超出float型变量的范围,则溢出.
4. float型赋给double型: 数值不变,扩展有效位数
5. 字符型赋给整形: 将字符的ASCII码赋给整形变量
6. 占字节多的整形赋给占字节少的整形: 只将其低字节原封不动地送到被赋值的变量
** 数据的输入输出
printf
#+BEGIN_SRC c
printf(参数1,参数2,参数3,...,参数n)
/*
参数1是格式控制字符串,参数2~参数n是需要输出的数据
常用格式字符:
d 有符号十进制整数
c 字符
s 字符串
f 浮点数
*/
#+END_SRC
scanf
#+BEGIN_SRC c
scanf(参数1,参数2,参数3,...,参数n)
/*
参数1是格式控制字符串,参数2~参数n是变量的地址
scanf("%d a=%f,c=%c",&a,&b,&c);
其输入必须形如"20 a=3.14,c=A",
即输入的内容必须与控制字符串完全一致,
只有控制字符被真实的字符取代了.
*/
#+END_SRC
putchar
#+BEGIN_SRC c
putchar(c)  //输出一个字符
#+END_SRC
getchar
#+BEGIN_SRC c
getchar()   //输入一个字符,按enter结束输入

/*
若是连续2个getchar(),应该输入2个字符,然后enter结束输入
而非每输入一个字符按一次enter,否则enter也会被当做输入字符
*/
a=getchar();
b=getchar();
...
#+END_SRC

* 选择结构程序设计
** if语句
#+BEGIN_SRC c
1.
if(表达式) 语句1

2.
if(表达式) 
    语句1
else
    语句2

3.
if(表达式1) 语句1
else if(表达式2) 语句2
else if(表达式3) 语句3
...
else if(表达式m) 语句m
else 语句m+1
#+END_SRC
** 关系运算符和关系表达式
关系表达式的值是一个逻辑值,"真"或"假".用1表示"真",用0表示"假"
#+BEGIN_SRC c
a=3;
b=2;
d=a>b;   //d的值为1
#+END_SRC
** 逻辑运算符和逻辑表达式
+ 优先级 !高于&&高于||
  !高于算数运算符, &&和||低于算数运算符
+ *短路现象*:
   在逻辑表达式中,只有在必须执行下一个逻辑运算符才能求出表达式的值时,才执行该运算符.
** switch语句
switch语句是多分支选择语句
#+BEGIN_SRC c
switch(表达式)
{
case 常量1: 语句1
case 常量2: 语句2
...
case 常量n: 语句n
default:    语句n+1
}
#+END_SRC
说明:
1. switch后的表达式的值应为整数类型(包括字符型)
2. case后面跟一个常量或常量表达式,每一个常量必须互不相同
3. case标号只起标记作用,找到匹配的标号入口后,就从此标号开始执行下去,可以使用break终止执行
4. 多个case标号可以共用一组执行语句
   #+BEGIN_SRC c
   case 'A':
   case 'B':
   case 'C': ...
   #+END_SRC

* 循环结构程序设计
** while语句
#+BEGIN_SRC c
while(表达式) 语句
#+END_SRC
while循环的特点是:先判断条件表达式,后执行循环体语句.
只要循环条件为真,就执行循环表达式.
** do-while语句
#+BEGIN_SRC c
do
    语句
while(表达式);
#+END_SRC
+ do-while的特点是:先无条件执行循环体,然后判断循环条件是否成立,若成立再执行循环体.
+ 当while后面的表达式第1次的值为"真"时,while和do-while得到的结果相同
** for语句
#+BEGIN_SRC c
for(表达式1; 表达式2; 表达式3)
    语句
/*
表达式1: 设置初始条件. 只执行一次
表达式2: 循环条件表达式,用于判断是否继续循环. 每次执行循环体前执行
表达式3: 作为循环的调整. 在执行完循环体后执行
*/

//等价的while表达式
表达式1;
while(表达式2)
{
    语句
    表达式3
}
#+END_SRC
** 改变循环执行的状态
+ 用break语句提前终止循环
+ 用continue语句体检结束本次循环

* 数组
1. 数组是一组有序数据的集合
2. 用一个数组名和下表可以唯一确定数组中的元素
3. 数组用的每一个元素都属于同一类型
** 一维数组
*** 定义
#+BEGIN_SRC c
类型 数组名[常量表达式]
/*
方括号中的常量表达式用来指定数组中元素的个数
*/

//举例
int a[10];
#+END_SRC
#+BEGIN_SRC c
一种现象

/*如果在被调用的函数(不包括主函数)中定义数组,
其长度可是是变量或非常量表达式*/
void func(int n)
{
   int a[2*n];
   ...
}
#+END_SRC
*** 引用数组元素
#+BEGIN_SRC c
数组名[下标]
#+END_SRC
*** 初始化
1. 在定义时对全部数组元素赋初值
   #+BEGIN_SRC c
   int a[10]={0,1,2,3,4,5,6,7,8,9};
   int a[]={0,1,2,3,4,5,6,7,8,9};    //可以不指定数组长度
   #+END_SRC
2. 只给数组中一部分元素赋初值
   #+BEGIN_SRC c
   int a[10]={0,1,2,3,4};  //只给前5个元素赋初值,后5个自动赋为0
   #+END_SRC
3. 全部元素赋为同一个初值
   #+BEGIN_SRC c
   int a[10]={0};
   #+END_SRC
** 二维数组
