html/c程序设计.html
<li>浮点型赋给整型: 先舍去小数部分,然后赋给整型变量
</li>
<li>整型赋给浮点型: 数值不变,但以浮点数形式存储
</li>
<li>double型赋给float型: 截取6~7位有效数字.若值超出float型变量的范围,则溢出.
</li>
<li>float型赋给double型: 数值不变,扩展有效位数
</li>
<li>字符型赋给整形: 将字符的ASCII码赋给整形变量
</li>
<li>占字节多的整形赋给占字节少的整形: 只将其低字节原封不动地送到被赋值的变量
</li>
</ol>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> 数据的输入输出</h3>
<div class="outline-text-3" id="text-1-11">

<p>printf
</p>


<pre class="src src-c">printf(&#21442;&#25968;1,&#21442;&#25968;2,&#21442;&#25968;3,...,&#21442;&#25968;n)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#21442;&#25968;1&#26159;&#26684;&#24335;&#25511;&#21046;&#23383;&#31526;&#20018;,&#21442;&#25968;2~&#21442;&#25968;n&#26159;&#38656;&#35201;&#36755;&#20986;&#30340;&#25968;&#25454;</span>
<span style="color: #b22222;">&#24120;&#29992;&#26684;&#24335;&#23383;&#31526;:</span>
<span style="color: #b22222;">d &#26377;&#31526;&#21495;&#21313;&#36827;&#21046;&#25972;&#25968;</span>
<span style="color: #b22222;">c &#23383;&#31526;</span>
<span style="color: #b22222;">s &#23383;&#31526;&#20018;</span>
<span style="color: #b22222;">f &#28014;&#28857;&#25968;</span>
<span style="color: #b22222;">*/</span>
</pre>

<p>
scanf
</p>


<pre class="src src-c">scanf(&#21442;&#25968;1,&#21442;&#25968;2,&#21442;&#25968;3,...,&#21442;&#25968;n)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#21442;&#25968;1&#26159;&#26684;&#24335;&#25511;&#21046;&#23383;&#31526;&#20018;,&#21442;&#25968;2~&#21442;&#25968;n&#26159;&#21464;&#37327;&#30340;&#22320;&#22336;</span>
<span style="color: #b22222;">scanf("%d a=%f,c=%c",&amp;a,&amp;b,&amp;c);</span>
<span style="color: #b22222;">&#20854;&#36755;&#20837;&#24517;&#39035;&#24418;&#22914;"20 a=3.14,c=A",</span>
<span style="color: #b22222;">&#21363;&#36755;&#20837;&#30340;&#20869;&#23481;&#24517;&#39035;&#19982;&#25511;&#21046;&#23383;&#31526;&#20018;&#23436;&#20840;&#19968;&#33268;,</span>
<span style="color: #b22222;">&#21482;&#26377;&#25511;&#21046;&#23383;&#31526;&#34987;&#30495;&#23454;&#30340;&#23383;&#31526;&#21462;&#20195;&#20102;.</span>
<span style="color: #b22222;">*/</span>
</pre>

<p>
putchar
</p>


<pre class="src src-c">putchar(c)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36755;&#20986;&#19968;&#20010;&#23383;&#31526;</span>
</pre>

<p>
getchar
</p>


<pre class="src src-c">getchar()   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36755;&#20837;&#19968;&#20010;&#23383;&#31526;,&#25353;enter&#32467;&#26463;&#36755;&#20837;</span>

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#33509;&#26159;&#36830;&#32493;2&#20010;getchar(),&#24212;&#35813;&#36755;&#20837;2&#20010;&#23383;&#31526;,&#28982;&#21518;enter&#32467;&#26463;&#36755;&#20837;</span>
<span style="color: #b22222;">&#32780;&#38750;&#27599;&#36755;&#20837;&#19968;&#20010;&#23383;&#31526;&#25353;&#19968;&#27425;enter,&#21542;&#21017;enter&#20063;&#20250;&#34987;&#24403;&#20570;&#36755;&#20837;&#23383;&#31526;</span>
<span style="color: #b22222;">*/</span>
a=getchar();
b=getchar();
...
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 选择结构程序设计</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> if语句</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-c">1.
<span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;) &#35821;&#21477;1

2.
<span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;) 
    &#35821;&#21477;1
<span style="color: #a020f0;">else</span>
    &#35821;&#21477;2

3.
<span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;1) &#35821;&#21477;1
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;2) &#35821;&#21477;2
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;3) &#35821;&#21477;3
...
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(&#34920;&#36798;&#24335;m) &#35821;&#21477;m
<span style="color: #a020f0;">else</span> &#35821;&#21477;m+1
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 关系运算符和关系表达式</h3>
<div class="outline-text-3" id="text-2-2">

<p>关系表达式的值是一个逻辑值,"真"或"假".用1表示"真",用0表示"假"
</p>


<pre class="src src-c">a=3;
b=2;
d=a&gt;b;   <span style="color: #b22222;">//</span><span style="color: #b22222;">d&#30340;&#20540;&#20026;1</span>
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 逻辑运算符和逻辑表达式</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>优先级 !高于&amp;&amp;高于||
  !高于算数运算符, &amp;&amp;和||低于算数运算符
</li>
<li><b>短路现象</b>:
   在逻辑表达式中,只有在必须执行下一个逻辑运算符才能求出表达式的值时,才执行该运算符.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> switch语句</h3>
<div class="outline-text-3" id="text-2-4">

<p>switch语句是多分支选择语句
</p>


<pre class="src src-c"><span style="color: #a020f0;">switch</span>(&#34920;&#36798;&#24335;)
{
<span style="color: #a020f0;">case</span> &#24120;&#37327;1: &#35821;&#21477;1
<span style="color: #a020f0;">case</span> &#24120;&#37327;2: &#35821;&#21477;2
...
<span style="color: #a020f0;">case</span> &#24120;&#37327;n: &#35821;&#21477;n
<span style="color: #a020f0;">default</span>:    &#35821;&#21477;n+1
}
</pre>

<p>
说明:
</p><ol>
<li>switch后的表达式的值应为整数类型(包括字符型)
</li>
<li>case后面跟一个常量或常量表达式,每一个常量必须互不相同
</li>
<li>case标号只起标记作用,找到匹配的标号入口后,就从此标号开始执行下去,可以使用break终止执行
</li>
<li>多个case标号可以共用一组执行语句



<pre class="src src-c"><span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'A'</span>:
<span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'B'</span>:
<span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'C'</span>: ...
</pre>

</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 循环结构程序设计</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> while语句</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-c"><span style="color: #a020f0;">while</span>(&#34920;&#36798;&#24335;) &#35821;&#21477;
</pre>

<p>
while循环的特点是:先判断条件表达式,后执行循环体语句.
只要循环条件为真,就执行循环表达式.
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> do-while语句</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-c"><span style="color: #a020f0;">do</span>
    &#35821;&#21477;
<span style="color: #a020f0;">while</span>(&#34920;&#36798;&#24335;);
</pre>

<ul>
<li>do-while的特点是:先无条件执行循环体,然后判断循环条件是否成立,若成立再执行循环体.
</li>
<li>当while后面的表达式第1次的值为"真"时,while和do-while得到的结果相同
</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> for语句</h3>
<div class="outline-text-3" id="text-3-3">




<pre class="src src-c"><span style="color: #a020f0;">for</span>(&#34920;&#36798;&#24335;1; &#34920;&#36798;&#24335;2; &#34920;&#36798;&#24335;3)
    <span style="color: #228b22;">&#35821;&#21477;</span>
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#34920;&#36798;&#24335;1: &#35774;&#32622;&#21021;&#22987;&#26465;&#20214;. &#21482;&#25191;&#34892;&#19968;&#27425;</span>
<span style="color: #b22222;">&#34920;&#36798;&#24335;2: &#24490;&#29615;&#26465;&#20214;&#34920;&#36798;&#24335;,&#29992;&#20110;&#21028;&#26029;&#26159;&#21542;&#32487;&#32493;&#24490;&#29615;. &#27599;&#27425;&#25191;&#34892;&#24490;&#29615;&#20307;&#21069;&#25191;&#34892;</span>
<span style="color: #b22222;">&#34920;&#36798;&#24335;3: &#20316;&#20026;&#24490;&#29615;&#30340;&#35843;&#25972;. &#22312;&#25191;&#34892;&#23436;&#24490;&#29615;&#20307;&#21518;&#25191;&#34892;</span>
<span style="color: #b22222;">*/</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#20215;&#30340;while&#34920;&#36798;&#24335;</span>
<span style="color: #a0522d;">&#34920;&#36798;&#24335;1</span>;
<span style="color: #a020f0;">while</span>(&#34920;&#36798;&#24335;2)
{
    <span style="color: #228b22;">&#35821;&#21477;</span>
    <span style="color: #a0522d;">&#34920;&#36798;&#24335;3</span>
}
</pre>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 改变循环执行的状态</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>用break语句提前终止循环
</li>
<li>用continue语句体检结束本次循环
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 数组</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>数组是一组有序数据的集合
</li>
<li>用一个数组名和下表可以唯一确定数组中的元素
</li>
<li>数组用的每一个元素都属于同一类型
</li>
</ol>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 一维数组</h3>
<div class="outline-text-3" id="text-4-1">


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 定义</h4>
<div class="outline-text-4" id="text-4-1-1">




<pre class="src src-c"><span style="color: #228b22;">&#31867;&#22411;</span> <span style="color: #a0522d;">&#25968;&#32452;&#21517;</span>[&#24120;&#37327;&#34920;&#36798;&#24335;]
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#26041;&#25324;&#21495;&#20013;&#30340;&#24120;&#37327;&#34920;&#36798;&#24335;&#29992;&#26469;&#25351;&#23450;&#25968;&#32452;&#20013;&#20803;&#32032;&#30340;&#20010;&#25968;</span>
<span style="color: #b22222;">*/</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20030;&#20363;</span>
<span style="color: #228b22;">int</span> a[10];
</pre>


<pre class="src src-c">&#19968;&#31181;&#29616;&#35937;

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#22914;&#26524;&#22312;&#34987;&#35843;&#29992;&#30340;&#20989;&#25968;(&#19981;&#21253;&#25324;&#20027;&#20989;&#25968;)&#20013;&#23450;&#20041;&#25968;&#32452;,</span>
<span style="color: #b22222;">&#20854;&#38271;&#24230;&#21487;&#26159;&#26159;&#21464;&#37327;&#25110;&#38750;&#24120;&#37327;&#34920;&#36798;&#24335;</span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">func</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">n</span>)
{
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[2*n];
   ...
}
</pre>

</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 引用数组元素</h4>
<div class="outline-text-4" id="text-4-1-2">




<pre class="src src-c">&#25968;&#32452;&#21517;[&#19979;&#26631;]
</pre>

</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> 初始化</h4>
<div class="outline-text-4" id="text-4-1-3">

<ol>
<li>在定义时对全部数组元素赋初值



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[10]={0,1,2,3,4,5,6,7,8,9};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[]={0,1,2,3,4,5,6,7,8,9};    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21487;&#20197;&#19981;&#25351;&#23450;&#25968;&#32452;&#38271;&#24230;</span>
</pre>

</li>
<li>只给数组中一部分元素赋初值



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[10]={0,1,2,3,4};  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21482;&#32473;&#21069;5&#20010;&#20803;&#32032;&#36171;&#21021;&#20540;,&#21518;5&#20010;&#33258;&#21160;&#36171;&#20026;0</span>
</pre>

</li>
<li>全部元素赋为同一个初值



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[10]={0};
</pre>

</li>
</ol>

</div>
</div>

</div>
