src/c程序设计.org
*** 定义
#+BEGIN_SRC c
类型符 数组名[常量表达式][常量表达式];

/*
二维数组中元素排列顺序是按行存放的,
内存中先顺序存放第1行的元素,接着在存放第2行的元素,依此类推
*/
#+END_SRC
*** 引用数组元素
#+BEGIN_SRC c
数组名[下标][下标]
#+END_SRC
*** 初始化
1. 全部元素初始化
   #+BEGIN_SRC c
   int a[3][4]={{1,2,3,4}, {5,6,7,8}, {9,10,11,12}};
   int a[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};   //第一种更清晰
   //可以不指定第1维的长度,第2维不能省
   int a[][4]={{1,2,3,4}, {5,6,7,8}, {9,10,11,12}};
   int a[][4]={1,2,3,4,5,6,7,8,9,10,11,12};
   #+END_SRC
2. 部分元素初始化
   #+BEGIN_SRC c
   int a[3][4]={{1}, {5}, {9}}; //1,0,0,0; 5,0,0,0; 9,0,0,0
   int a[3][4]={{1}, {5,6}};    //1,0,0,0; 5,6,0,0; 0,0,0,0
   #+END_SRC
** 字符数组
*** 定义
#+BEGIN_SRC c
char c[10];
#+END_SRC
*** 初始化
#+BEGIN_SRC c
//全部初始化
char c[10]={'a','b','c','d','e','f','g','h','i','j'};
char c[]={'a','b','c','d','e','f','g','h','i','j'};
char c[]={"abcdefghij"};  //长度为11,而不是10,会自动添加一个'\0'
char c[]="abcdefghij";    //同上

//部分初始化
char c[10]={'a','b','c'}; //值初始化字符数组中前面的元素,其余自动为空字符'\0'
#+END_SRC
*** 字符串
+ 在c语言中,将字符串作为字符数组处理
+ 以'\0'作为结束标识符的原因是需要直到字符串的有效长度
+ c语言中,使用字符数组存储字符串常量时会自动添加一个'\0'作为结束符
*** 字符数组的输入输出
#+BEGIN_SRC c
输出

char c[]="China";
printf("%s\n",c);
/*
1. 输出遇到'\0'就结束
2. 输出的字符中不包括结束符'\0'
*/

输入

scanf("%s",c)

char str1[5],str2[5],str3[5];
scanf("%s%s%s",str1,str2,str3);
/*
1. 输入的字符串应短于已定义的字符数组的长度
2. 如果利用一个scanf函数输入多个字符串,则应在输入是以空格分隔
3. 数组中未被赋值的元素的值自动置'\0'
*/
#+END_SRC
*** 字符串处理函数
+ puts
  将字符串输出到终端,在输出时将字符串结束符'\0'转换成'\n',即自动换行
  #+BEGIN_SRC c
  char str[] = "hello\nworld";
  puts(str);
  #+END_SRC
+ gets
  从终端输入一个字符串到字符数组
  #+BEGIN_SRC c
  gets(str);
  #+END_SRC
+ strcat
  字符串连接函数
  #+BEGIN_SRC c
  strcat(字符数组1, 字符数组2)
  /*
    把字符串2连接到字符串1的后面
    1. 结果放在字符数组1中
    2. 字符数组1必须足够大,以容纳连接后的新字符串
  /*
  #+END_SRC
+ strcpy和scrncpy
  字符串赋值函数
  #+BEGIN_SRC c
  strcpy(字符数组1, 字符数组2/字符串2)
  strncpy(字符数组1, 字符数组2/字符串2,n)
  /*
    把字符串2复制到字符数组1中
    把字符串2中前n个字符复制到字符数组1中
    1. 字符数组1的长度应大于等于字符串2的长度
  */
  #+END_SRC
+ strcmp
  字符串比较函数
  #+BEGIN_SRC c
  strcmp(字符串1, 字符串2)
  /*
    如果 字符串1=字符串2 ,返回0
    如果 字符串1>字符串2 ,返回正
    如果 字符串1<字符串2 ,返回负
  */
  #+END_SRC
+ strlen
  测字符串长度的函数
  #+BEGIN_SRC c
  strlen(字符数组)
  /*
    返回字符串的实际长度(不包括'\0')
  */
  #+END_SRC
+ strlwr
  转换为小写的函数
  #+BEGIN_SRC c
  strlwr(字符串)
  #+END_SRC
+ strupr
  转换为大写的函数
  #+BEGIN_SRC c
  strupr(字符串)
  #+END_SRC

* 函数
** 定义函数
#+BEGIN_SRC c
类型名 函数名(形参列表)
{
   函数体
}
#+END_SRC
** 调用函数
#+BEGIN_SRC c
函数名(实参列表)
#+END_SRC
