html/c程序设计.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 二维数组</h3>
<div class="outline-text-3" id="text-4-2">


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> 定义</h4>
<div class="outline-text-4" id="text-4-2-1">




<pre class="src src-c"><span style="color: #228b22;">&#31867;&#22411;&#31526;</span> <span style="color: #a0522d;">&#25968;&#32452;&#21517;</span>[&#24120;&#37327;&#34920;&#36798;&#24335;][&#24120;&#37327;&#34920;&#36798;&#24335;];

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#20108;&#32500;&#25968;&#32452;&#20013;&#20803;&#32032;&#25490;&#21015;&#39034;&#24207;&#26159;&#25353;&#34892;&#23384;&#25918;&#30340;,</span>
<span style="color: #b22222;">&#20869;&#23384;&#20013;&#20808;&#39034;&#24207;&#23384;&#25918;&#31532;1&#34892;&#30340;&#20803;&#32032;,&#25509;&#30528;&#22312;&#23384;&#25918;&#31532;2&#34892;&#30340;&#20803;&#32032;,&#20381;&#27492;&#31867;&#25512;</span>
<span style="color: #b22222;">*/</span>
</pre>

</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> 引用数组元素</h4>
<div class="outline-text-4" id="text-4-2-2">




<pre class="src src-c">&#25968;&#32452;&#21517;[&#19979;&#26631;][&#19979;&#26631;]
</pre>

</div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> 初始化</h4>
<div class="outline-text-4" id="text-4-2-3">

<ol>
<li>全部元素初始化



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[3][4]={{1,2,3,4}, {5,6,7,8}, {9,10,11,12}};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#31532;&#19968;&#31181;&#26356;&#28165;&#26224;</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21487;&#20197;&#19981;&#25351;&#23450;&#31532;1&#32500;&#30340;&#38271;&#24230;,&#31532;2&#32500;&#19981;&#33021;&#30465;</span>
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[][4]={{1,2,3,4}, {5,6,7,8}, {9,10,11,12}};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[][4]={1,2,3,4,5,6,7,8,9,10,11,12};
</pre>

</li>
<li>部分元素初始化



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[3][4]={{1}, {5}, {9}}; <span style="color: #b22222;">//</span><span style="color: #b22222;">1,0,0,0; 5,0,0,0; 9,0,0,0</span>
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[3][4]={{1}, {5,6}};    <span style="color: #b22222;">//</span><span style="color: #b22222;">1,0,0,0; 5,6,0,0; 0,0,0,0</span>
</pre>

</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 字符数组</h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> 定义</h4>
<div class="outline-text-4" id="text-4-3-1">




<pre class="src src-c"><span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[10];
</pre>

</div>

</div>

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> 初始化</h4>
<div class="outline-text-4" id="text-4-3-2">




<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#20840;&#37096;&#21021;&#22987;&#21270;</span>
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[10]={<span style="color: #8b2252;">'a'</span>,<span style="color: #8b2252;">'b'</span>,<span style="color: #8b2252;">'c'</span>,<span style="color: #8b2252;">'d'</span>,<span style="color: #8b2252;">'e'</span>,<span style="color: #8b2252;">'f'</span>,<span style="color: #8b2252;">'g'</span>,<span style="color: #8b2252;">'h'</span>,<span style="color: #8b2252;">'i'</span>,<span style="color: #8b2252;">'j'</span>};
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[]={<span style="color: #8b2252;">'a'</span>,<span style="color: #8b2252;">'b'</span>,<span style="color: #8b2252;">'c'</span>,<span style="color: #8b2252;">'d'</span>,<span style="color: #8b2252;">'e'</span>,<span style="color: #8b2252;">'f'</span>,<span style="color: #8b2252;">'g'</span>,<span style="color: #8b2252;">'h'</span>,<span style="color: #8b2252;">'i'</span>,<span style="color: #8b2252;">'j'</span>};
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[]={<span style="color: #8b2252;">"abcdefghij"</span>};  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38271;&#24230;&#20026;11,&#32780;&#19981;&#26159;10,&#20250;&#33258;&#21160;&#28155;&#21152;&#19968;&#20010;'\0'</span>
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[]=<span style="color: #8b2252;">"abcdefghij"</span>;    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21516;&#19978;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#37096;&#20998;&#21021;&#22987;&#21270;</span>
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[10]={<span style="color: #8b2252;">'a'</span>,<span style="color: #8b2252;">'b'</span>,<span style="color: #8b2252;">'c'</span>}; <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20540;&#21021;&#22987;&#21270;&#23383;&#31526;&#25968;&#32452;&#20013;&#21069;&#38754;&#30340;&#20803;&#32032;,&#20854;&#20313;&#33258;&#21160;&#20026;&#31354;&#23383;&#31526;'\0'</span>
</pre>

</div>

</div>

<div id="outline-container-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> 字符串</h4>
<div class="outline-text-4" id="text-4-3-3">

<ul>
<li>在c语言中,将字符串作为字符数组处理
</li>
<li>以'\0'作为结束标识符的原因是需要直到字符串的有效长度
</li>
<li>c语言中,使用字符数组存储字符串常量时会自动添加一个'\0'作为结束符
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> 字符数组的输入输出</h4>
<div class="outline-text-4" id="text-4-3-4">




<pre class="src src-c">&#36755;&#20986;

<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>[]=<span style="color: #8b2252;">"China"</span>;
printf(<span style="color: #8b2252;">"%s\n"</span>,c);
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">1. &#36755;&#20986;&#36935;&#21040;'\0'&#23601;&#32467;&#26463;</span>
<span style="color: #b22222;">2. &#36755;&#20986;&#30340;&#23383;&#31526;&#20013;&#19981;&#21253;&#25324;&#32467;&#26463;&#31526;'\0'</span>
<span style="color: #b22222;">*/</span>

<span style="color: #228b22;">&#36755;&#20837;</span>

<span style="color: #0000ff;">scanf</span>(<span style="color: #8b2252;">"%s"</span>,c)

<span style="color: #228b22;">char</span> <span style="color: #a0522d;">str1</span>[5],<span style="color: #a0522d;">str2</span>[5],<span style="color: #a0522d;">str3</span>[5];
scanf(<span style="color: #8b2252;">"%s%s%s"</span>,str1,str2,str3);
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">1. &#36755;&#20837;&#30340;&#23383;&#31526;&#20018;&#24212;&#30701;&#20110;&#24050;&#23450;&#20041;&#30340;&#23383;&#31526;&#25968;&#32452;&#30340;&#38271;&#24230;</span>
<span style="color: #b22222;">2. &#22914;&#26524;&#21033;&#29992;&#19968;&#20010;scanf&#20989;&#25968;&#36755;&#20837;&#22810;&#20010;&#23383;&#31526;&#20018;,&#21017;&#24212;&#22312;&#36755;&#20837;&#26159;&#20197;&#31354;&#26684;&#20998;&#38548;</span>
<span style="color: #b22222;">3. &#25968;&#32452;&#20013;&#26410;&#34987;&#36171;&#20540;&#30340;&#20803;&#32032;&#30340;&#20540;&#33258;&#21160;&#32622;'\0'</span>
<span style="color: #b22222;">*/</span>
</pre>

</div>

</div>

<div id="outline-container-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> 字符串处理函数</h4>
<div class="outline-text-4" id="text-4-3-5">

<ul>
<li>puts
  将字符串输出到终端,在输出时将字符串结束符'\0'转换成'\n',即自动换行



<pre class="src src-c"><span style="color: #228b22;">char</span> <span style="color: #a0522d;">str</span>[] = <span style="color: #8b2252;">"hello\nworld"</span>;
puts(str);
</pre>

</li>
<li>gets
  从终端输入一个字符串到字符数组



<pre class="src src-c">gets(str);
</pre>

</li>
<li>strcat
  字符串连接函数



<pre class="src src-c">strcat(&#23383;&#31526;&#25968;&#32452;1, &#23383;&#31526;&#25968;&#32452;2)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  &#25226;&#23383;&#31526;&#20018;2&#36830;&#25509;&#21040;&#23383;&#31526;&#20018;1&#30340;&#21518;&#38754;</span>
<span style="color: #b22222;">  1. &#32467;&#26524;&#25918;&#22312;&#23383;&#31526;&#25968;&#32452;1&#20013;</span>
<span style="color: #b22222;">  2. &#23383;&#31526;&#25968;&#32452;1&#24517;&#39035;&#36275;&#22815;&#22823;,&#20197;&#23481;&#32435;&#36830;&#25509;&#21518;&#30340;&#26032;&#23383;&#31526;&#20018;</span>
<span style="color: #b22222;">/*</span>
</pre>

</li>
<li>strcpy和scrncpy
  字符串赋值函数



<pre class="src src-c">strcpy(&#23383;&#31526;&#25968;&#32452;1, &#23383;&#31526;&#25968;&#32452;2/&#23383;&#31526;&#20018;2)
strncpy(&#23383;&#31526;&#25968;&#32452;1, &#23383;&#31526;&#25968;&#32452;2/&#23383;&#31526;&#20018;2,n)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  &#25226;&#23383;&#31526;&#20018;2&#22797;&#21046;&#21040;&#23383;&#31526;&#25968;&#32452;1&#20013;</span>
<span style="color: #b22222;">  &#25226;&#23383;&#31526;&#20018;2&#20013;&#21069;n&#20010;&#23383;&#31526;&#22797;&#21046;&#21040;&#23383;&#31526;&#25968;&#32452;1&#20013;</span>
<span style="color: #b22222;">  1. &#23383;&#31526;&#25968;&#32452;1&#30340;&#38271;&#24230;&#24212;&#22823;&#20110;&#31561;&#20110;&#23383;&#31526;&#20018;2&#30340;&#38271;&#24230;</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>strcmp
  字符串比较函数



<pre class="src src-c">strcmp(&#23383;&#31526;&#20018;1, &#23383;&#31526;&#20018;2)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  &#22914;&#26524; &#23383;&#31526;&#20018;1=&#23383;&#31526;&#20018;2 ,&#36820;&#22238;0</span>
<span style="color: #b22222;">  &#22914;&#26524; &#23383;&#31526;&#20018;1&gt;&#23383;&#31526;&#20018;2 ,&#36820;&#22238;&#27491;</span>
<span style="color: #b22222;">  &#22914;&#26524; &#23383;&#31526;&#20018;1&lt;&#23383;&#31526;&#20018;2 ,&#36820;&#22238;&#36127;</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>strlen
  测字符串长度的函数



<pre class="src src-c">strlen(&#23383;&#31526;&#25968;&#32452;)
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">  &#36820;&#22238;&#23383;&#31526;&#20018;&#30340;&#23454;&#38469;&#38271;&#24230;(&#19981;&#21253;&#25324;'\0')</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>strlwr
  转换为小写的函数



<pre class="src src-c">strlwr(&#23383;&#31526;&#20018;)
</pre>

</li>
<li>strupr
  转换为大写的函数



<pre class="src src-c">strupr(&#23383;&#31526;&#20018;)
</pre>

</li>
</ul>


</div>
</div>
</div>

</div>
