src/c程序设计.org
** 函数声明
+ 如果调用库函数,应该在文件开头用#include将库包含进来
+ 如果使用用户自己定义的函数,且该函数的位置在主调函数的后面,应该在主调函数中对被调函数作声明
  #+BEGIN_SRC c
  函数类型 函数名(参数类型1 参数名1,参数类型2 参数名2,...,参数类型n 参数名n);
  函数类型 函数名(参数类型1,参数类型2,...,参数类型n);
  #+END_SRC
  函数定义和函数声明不是同一回事.
  1. 函数定义是指对函数功能的确立,包括指定函数名,函数值类型,形参及其函数体等,他是一个完整的,独立的函数单位.
  2. 函数声明的作用则是把函数的名字,函数类型以及形参类型,个数和顺序通知编译器,以便 *在调用该函数时系统按此声明进行对照检查*
** 函数的嵌套调用
c语言中函数不能嵌套定义,但可以嵌套调用.
** 函数的递归调用
直接或间接地调用该函数本身,称为函数的递归调用
** 数组作为函数参数
用数组名作函数实参时,向形参(数组名或指针变量)传递的是数组首元素的地址
+ 实参数组和形参数组类型应一致,如不一致,结果将出错
+ *编译器将实参数组的首元素地址传给形参数组名*
+ 形参数组首元素和实参数组首元素具有同一地址,指向同一存储单元.
+ *形参数组可以不指定大小*,在定义数组时在数组后面跟一个空的方括号
#+BEGIN_SRC c
int main()
{
    float score[] = {1,2,3,4};
    average(score);
    return 0;
}

float average(float array[])
{
    ...
}
#+END_SRC
*** 多维数组
+ 可以用多维数组名作函数的实参和形参.
+ 在被调函数中对形参数组定义时
  1. 可以指定每一维的大小
  2. 也可以省略第一维的大小
+ c语言编译器不检查第一维的大小
  #+BEGIN_SRC c
  float average(float array[3][10])
  {
      ...
  }
  或
  float average(float array[][10])
  {
      ...
  }
  #+END_SRC
#+BEGIN_EXAMPLE
为什么形参可以指定为float array[][10],
而不能指定为float array[3][]?

因为二维数组在内存中是按行存放的,因此,在定义二维数组时,
必须指定列数,即一行中包含几个元素
#+END_EXAMPLE
** 局部变量和全局变量
*** 局部变量
+ 在一个函数内部定义的变量只在本函数范围内有效
+ 在一个复合语句内部定义的变量只在本复合语句范围内有效
+ *形参也是局部变量*
*** 全局变量
+ 在函数之外定义的变量是全局变量
+ 全局变量的有效范围从定义变量的位置开始到源文件结束
+ 全局变量在程序的全部执行过程中都占用存储单元,而不是仅在需要时才开辟单元
** 变量的存储方式和生存期
存储变量的两种不同方式
1. 静态存储方式
   在程序运行期间由系统分配固定的存储空间
2. 动态存储方式
   在程序运行期间根据需要进行动态的分配存储空间
内存存储空间划分
1. 程序区
2. 静态存储区
3. 动态存储区
变量的存储类别
1. 自动变量
   #+BEGIN_EXAMPLE
   [auto+局部变量] 或 [局部变量]
   关键字: auto
   存储空间: 动态存储区
   初值: 初值不确定
   说明: 在调用函数时,系统给自动变量分配存储空间,
   在函数调用结束时,自动释放这些存储空间
   #+END_EXAMPLE
2. 静态局部变量
   #+BEGIN_EXAMPLE
   [static+局部变量]
   关键字: static
   存储空间: 静态存储区
   初值: 在编译时自动赋初值0(对数值型变量)或'\0'(对字符变量)
   说明: 静态局部变量在函数调用结束后任然存在
   #+END_EXAMPLE
3. 寄存器变量
   #+BEGIN_EXAMPLE
   [register+局部变量]
   关键字: register
   存储空间: 寄存器
   说明: 有一些变量使用频繁,为提高执行效率,允许将局部变量的值存放在cup寄存器中
   现在优化的编译系统能够识别使用频繁的变量,自动将这些变量放在寄存器中,
   而不需要程序设计者指定
   #+END_EXAMPLE
4. 外部变量
   #+BEGIN_EXAMPLE
   [全局变量]
   关键字: 无
   存储空间: 静态存储区
   说明: 外部变量的有效范围限于定义处到文件结束.
   如果需要在外部变量定义之前引用该外部变量,应该在引用之前用extern
   对该变量作外部变量声明,表示把该外部变量的作用域扩展到此位置.
   如果需要在某个文件中引用在其他文件中定义的外部变量,同样需要作外部变量声明
   #+END_EXAMPLE
5. 静态外部变量
   #+BEGIN_EXAMPLE
   [static+全局变量]
   关键字: static
   存储空间: 静态存储区
   说明: 如果不希望外部变量被其他文件引用(即仅限于本文件中使用),
   在外部变量前加一个static
   #+END_EXAMPLE
** 变量的声明和定义
+ 把建立存储空间的声明称定义
+ 把不需要建立存储空间的声明称声明
+ [extern+变量名]是声明,除此之外,对变量的声明都是定义
** 内部函数和外部函数
+ 内部函数: 只能被本文件中其他函数调用的函数
  #+BEGIN_SRC c
  static 类型名 函数名(形参表);
  #+END_SRC
+ 外部函数: 可以被其他文件调用的函数
  #+BEGIN_SRC c
  extern 类型名 函数名(形参表);
  类型名 函数名(形参表);          //默认是外部函数
  #+END_SRC

* 指针
+ 直接访问:
  *变量名与变量的地址一一对应*,直接用变量名对变量的存储单元进行访问
+ 间接访问:
  先通过存放 *变量i地址的变量p* 得到变量i的地址,然后对变量i的存储单元其进行访问
+ *指针*: 一个变量的地址称为该变量的指针
+ *指针变量*: 一个专门用来存放指针(地址)的变量
** 指针变量
*** 定义指针变量
#+BEGIN_SRC c
类型名 * 指针变量名;
#+END_SRC
#+BEGIN_SRC c
例子

int * pointer_1, * pointer_2;
float * pointer_3 = &a;
#+END_SRC
+ 指针类型由基本类型和星号组成.在定义指针变量时必须指定基类型
+ 指针变量中只能存放地址(指针),不能将一个整数赋给一个指针变量
#+BEGIN_EXAMPLE
为什么在定义指针变量时必须指定基类型?

如果想通过指针引用一个变量,只知道地址是不够的,必须还要直到数据所占字节数.
#+END_EXAMPLE
*** 引用指针变量
#+BEGIN_SRC c
//引用指针变量的值
p = &a;
printf("%o",p);

//引用指针变量指向的变量
*p = 1;
#+END_SRC
*** 指针变量作函数参数
注意: 在函数调用时,将实参变量的值传递给形参变量,永远采取 *值传递* 的方式
因此指针变量作函数参数时,实参传递给形参的是 *指针变量的值*,即一个指针(地址)
** 通过指针引用数组 
*** 数组元素的指针
#+BEGIN_SRC c
int a[3] = {1,2,3};
int *p;
p=&a[2];
#+END_SRC
数组名代表 *数组元素中首元素的地址*
#+BEGIN_SRC c
p=&a[0];
等价于
p=a;
#+END_SRC
*** 指针的运算
*当指针指向数组元素时*,允许对指针进行如下运算
1. 加/减一个整数
2. 自加/减
3. 两个指针相减(两指针必须指向同一数组中的元素)
4. 注意:
   #+BEGIN_EXAMPLE
   1. p+i并非将p的值(地址)简单地加i,而是加上i个数组元素所占用的字节数
   2. p2-p1的结果,其意义是p2所指的元素与p1所指的元素之间差多少个元素,
      代表了p2与p1的相对距离
   #+END_EXAMPLE
*** 通过指针引用数组
1. 下标法
   a[i] p[i] 数组名是指针常量,固定为数组首元素地址;指针变量可以指向数组中任意元素
2. 指针法
   *(a+i) *(p+i)
3. 注意:
  #+BEGIN_SRC c
  *p++
  //由于++和*同优先级,结合方向自右而左,因此等价于
  *(p++)
  //先引用p的值,实现*p,然后再使p自增1
  #+END_SRC
