html/c程序设计.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 函数</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 定义函数</h3>
<div class="outline-text-3" id="text-5-1">




<pre class="src src-c"><span style="color: #228b22;">&#31867;&#22411;&#21517;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(&#24418;&#21442;&#21015;&#34920;)
{
   &#20989;&#25968;&#20307;
}
</pre>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 调用函数</h3>
<div class="outline-text-3" id="text-5-2">




<pre class="src src-c">&#20989;&#25968;&#21517;(&#23454;&#21442;&#21015;&#34920;)
</pre>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 函数声明</h3>
<div class="outline-text-3" id="text-5-3">

<ul>
<li>如果调用库函数,应该在文件开头用#include将库包含进来
</li>
<li>如果使用用户自己定义的函数,且该函数的位置在主调函数的后面,应该在主调函数中对被调函数作声明



<pre class="src src-c"><span style="color: #228b22;">&#20989;&#25968;&#31867;&#22411;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;1</span> <span style="color: #a0522d;">&#21442;&#25968;&#21517;1</span>,<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;2</span> <span style="color: #a0522d;">&#21442;&#25968;&#21517;2</span>,...,<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;n</span> <span style="color: #a0522d;">&#21442;&#25968;&#21517;n</span>);
<span style="color: #228b22;">&#20989;&#25968;&#31867;&#22411;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;1</span>,<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;2</span>,...,<span style="color: #228b22;">&#21442;&#25968;&#31867;&#22411;n</span>);
</pre>

<p>
  函数定义和函数声明不是同一回事.
</p><ol>
<li>函数定义是指对函数功能的确立,包括指定函数名,函数值类型,形参及其函数体等,他是一个完整的,独立的函数单位.
</li>
<li>函数声明的作用则是把函数的名字,函数类型以及形参类型,个数和顺序通知编译器,以便 <b>在调用该函数时系统按此声明进行对照检查</b>
</li>
</ol>

</li>
</ul>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 函数的嵌套调用</h3>
<div class="outline-text-3" id="text-5-4">

<p>c语言中函数不能嵌套定义,但可以嵌套调用.
</p></div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 函数的递归调用</h3>
<div class="outline-text-3" id="text-5-5">

<p>直接或间接地调用该函数本身,称为函数的递归调用
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 数组作为函数参数</h3>
<div class="outline-text-3" id="text-5-6">

<p>用数组名作函数实参时,向形参(数组名或指针变量)传递的是数组首元素的地址
</p><ul>
<li>实参数组和形参数组类型应一致,如不一致,结果将出错
</li>
<li><b>编译器将实参数组的首元素地址传给形参数组名</b>
</li>
<li>形参数组首元素和实参数组首元素具有同一地址,指向同一存储单元.
</li>
<li><b>形参数组可以不指定大小</b>,在定义数组时在数组后面跟一个空的方括号
</li>
</ul>




<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">score</span>[] = {1,2,3,4};
    average(score);
    <span style="color: #a020f0;">return</span> 0;
}

<span style="color: #228b22;">float</span> <span style="color: #0000ff;">average</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">array</span>[])
{
    ...
}
</pre>


</div>

<div id="outline-container-5-6-1" class="outline-4">
<h4 id="sec-5-6-1"><span class="section-number-4">5.6.1</span> 多维数组</h4>
<div class="outline-text-4" id="text-5-6-1">

<ul>
<li>可以用多维数组名作函数的实参和形参.
</li>
<li>在被调函数中对形参数组定义时
<ol>
<li>可以指定每一维的大小
</li>
<li>也可以省略第一维的大小
</li>
</ol>

</li>
<li>c语言编译器不检查第一维的大小



<pre class="src src-c"><span style="color: #228b22;">float</span> <span style="color: #0000ff;">average</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">array</span>[3][10])
{
    ...
}
&#25110;
<span style="color: #228b22;">float</span> <span style="color: #0000ff;">average</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">array</span>[][10])
{
    ...
}
</pre>

</li>
</ul>




<pre class="example">为什么形参可以指定为float array[][10],
而不能指定为float array[3][]?

因为二维数组在内存中是按行存放的,因此,在定义二维数组时,
必须指定列数,即一行中包含几个元素
</pre>

</div>
</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> 局部变量和全局变量</h3>
<div class="outline-text-3" id="text-5-7">


</div>

<div id="outline-container-5-7-1" class="outline-4">
<h4 id="sec-5-7-1"><span class="section-number-4">5.7.1</span> 局部变量</h4>
<div class="outline-text-4" id="text-5-7-1">

<ul>
<li>在一个函数内部定义的变量只在本函数范围内有效
</li>
<li>在一个复合语句内部定义的变量只在本复合语句范围内有效
</li>
<li><b>形参也是局部变量</b>
</li>
</ul>

</div>

</div>

<div id="outline-container-5-7-2" class="outline-4">
<h4 id="sec-5-7-2"><span class="section-number-4">5.7.2</span> 全局变量</h4>
<div class="outline-text-4" id="text-5-7-2">

<ul>
<li>在函数之外定义的变量是全局变量
</li>
<li>全局变量的有效范围从定义变量的位置开始到源文件结束
</li>
<li>全局变量在程序的全部执行过程中都占用存储单元,而不是仅在需要时才开辟单元
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> 变量的存储方式和生存期</h3>
<div class="outline-text-3" id="text-5-8">

<p>存储变量的两种不同方式
</p><ol>
<li>静态存储方式
   在程序运行期间由系统分配固定的存储空间
</li>
<li>动态存储方式
   在程序运行期间根据需要进行动态的分配存储空间
</li>
</ol>

<p>内存存储空间划分
</p><ol>
<li>程序区
</li>
<li>静态存储区
</li>
<li>动态存储区
</li>
</ol>

<p>变量的存储类别
</p><ol>
<li>自动变量



<pre class="example">[auto+局部变量] 或 [局部变量]
关键字: auto
存储空间: 动态存储区
初值: 初值不确定
说明: 在调用函数时,系统给自动变量分配存储空间,
在函数调用结束时,自动释放这些存储空间
</pre>

</li>
<li>静态局部变量



<pre class="example">[static+局部变量]
关键字: static
存储空间: 静态存储区
初值: 在编译时自动赋初值0(对数值型变量)或'\0'(对字符变量)
说明: 静态局部变量在函数调用结束后任然存在
</pre>

</li>
<li>寄存器变量



<pre class="example">[register+局部变量]
关键字: register
存储空间: 寄存器
说明: 有一些变量使用频繁,为提高执行效率,允许将局部变量的值存放在cup寄存器中
现在优化的编译系统能够识别使用频繁的变量,自动将这些变量放在寄存器中,
而不需要程序设计者指定
</pre>

</li>
<li>外部变量



<pre class="example">[全局变量]
关键字: 无
存储空间: 静态存储区
说明: 外部变量的有效范围限于定义处到文件结束.
如果需要在外部变量定义之前引用该外部变量,应该在引用之前用extern
对该变量作外部变量声明,表示把该外部变量的作用域扩展到此位置.
如果需要在某个文件中引用在其他文件中定义的外部变量,同样需要作外部变量声明
</pre>

</li>
<li>静态外部变量



<pre class="example">[static+全局变量]
关键字: static
存储空间: 静态存储区
说明: 如果不希望外部变量被其他文件引用(即仅限于本文件中使用),
在外部变量前加一个static
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> 变量的声明和定义</h3>
<div class="outline-text-3" id="text-5-9">

<ul>
<li>把建立存储空间的声明称定义
</li>
<li>把不需要建立存储空间的声明称声明
</li>
<li>[extern+变量名]是声明,除此之外,对变量的声明都是定义
</li>
</ul>

</div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> 内部函数和外部函数</h3>
<div class="outline-text-3" id="text-5-10">

<ul>
<li>内部函数: 只能被本文件中其他函数调用的函数



<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #228b22;">&#31867;&#22411;&#21517;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(&#24418;&#21442;&#34920;);
</pre>

</li>
<li>外部函数: 可以被其他文件调用的函数



<pre class="src src-c"><span style="color: #a020f0;">extern</span> <span style="color: #228b22;">&#31867;&#22411;&#21517;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(&#24418;&#21442;&#34920;);
<span style="color: #228b22;">&#31867;&#22411;&#21517;</span> <span style="color: #0000ff;">&#20989;&#25968;&#21517;</span>(&#24418;&#21442;&#34920;);          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#40664;&#35748;&#26159;&#22806;&#37096;&#20989;&#25968;</span>
</pre>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 指针</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>直接访问:
  <b>变量名与变量的地址一一对应</b>,直接用变量名对变量的存储单元进行访问
</li>
<li>间接访问:
  先通过存放 <b>变量i地址的变量p</b> 得到变量i的地址,然后对变量i的存储单元其进行访问
</li>
<li><b>指针</b>: 一个变量的地址称为该变量的指针
</li>
<li><b>指针变量</b>: 一个专门用来存放指针(地址)的变量
</li>
</ul>


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 指针变量</h3>
<div class="outline-text-3" id="text-6-1">


</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 定义指针变量</h4>
<div class="outline-text-4" id="text-6-1-1">




<pre class="src src-c"><span style="color: #228b22;">&#31867;&#22411;&#21517;</span> * <span style="color: #a0522d;">&#25351;&#38024;&#21464;&#37327;&#21517;</span>;
</pre>


<pre class="src src-c">&#20363;&#23376;

<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">pointer_1</span>, * <span style="color: #a0522d;">pointer_2</span>;
<span style="color: #228b22;">float</span> * <span style="color: #a0522d;">pointer_3</span> = &amp;a;
</pre>

<ul>
<li>指针类型由基本类型和星号组成.在定义指针变量时必须指定基类型
</li>
<li>指针变量中只能存放地址(指针),不能将一个整数赋给一个指针变量
</li>
</ul>




<pre class="example">为什么在定义指针变量时必须指定基类型?

如果想通过指针引用一个变量,只知道地址是不够的,必须还要直到数据所占字节数.
</pre>

</div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 引用指针变量</h4>
<div class="outline-text-4" id="text-6-1-2">




<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#24341;&#29992;&#25351;&#38024;&#21464;&#37327;&#30340;&#20540;</span>
p = &amp;a;
printf(<span style="color: #8b2252;">"%o"</span>,p);

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#24341;&#29992;&#25351;&#38024;&#21464;&#37327;&#25351;&#21521;&#30340;&#21464;&#37327;</span>
*p = 1;
</pre>

</div>

</div>

<div id="outline-container-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> 指针变量作函数参数</h4>
<div class="outline-text-4" id="text-6-1-3">

<p>注意: 在函数调用时,将实参变量的值传递给形参变量,永远采取 <b>值传递</b> 的方式
因此指针变量作函数参数时,实参传递给形参的是 <b>指针变量的值</b>,即一个指针(地址)
</p></div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 通过指针引用数组</h3>
<div class="outline-text-3" id="text-6-2">


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> 数组元素的指针</h4>
<div class="outline-text-4" id="text-6-2-1">




<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[3] = {1,2,3};
<span style="color: #228b22;">int</span> *<span style="color: #a0522d;">p</span>;
p=&amp;a[2];
</pre>

<p>
数组名代表 <b>数组元素中首元素的地址</b>
</p>


<pre class="src src-c">p=&amp;a[0];
<span style="color: #228b22;">&#31561;&#20215;&#20110;</span>
<span style="color: #a0522d;">p</span>=a;
</pre>

</div>

</div>

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> 指针的运算</h4>
<div class="outline-text-4" id="text-6-2-2">

<p><b>当指针指向数组元素时</b>,允许对指针进行如下运算
</p><ol>
<li>加/减一个整数
</li>
<li>自加/减
</li>
<li>两个指针相减(两指针必须指向同一数组中的元素)
</li>
<li>注意:



<pre class="example">1. p+i并非将p的值(地址)简单地加i,而是加上i个数组元素所占用的字节数
2. p2-p1的结果,其意义是p2所指的元素与p1所指的元素之间差多少个元素,
   代表了p2与p1的相对距离
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> 通过指针引用数组</h4>
<div class="outline-text-4" id="text-6-2-3">

<ol>
<li>下标法
   a[i] p[i] 数组名是指针常量,固定为数组首元素地址;指针变量可以指向数组中任意元素
</li>
<li>指针法
   *(a+i) *(p+i)
</li>
<li>注意:



<pre class="src src-c">*p++
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#30001;&#20110;++&#21644;*&#21516;&#20248;&#20808;&#32423;,&#32467;&#21512;&#26041;&#21521;&#33258;&#21491;&#32780;&#24038;,&#22240;&#27492;&#31561;&#20215;&#20110;</span>
*(p++)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20808;&#24341;&#29992;p&#30340;&#20540;,&#23454;&#29616;*p,&#28982;&#21518;&#20877;&#20351;p&#33258;&#22686;1</span>
</pre>

</li>
</ol>

</div>

</div>
