src/c程序设计.org
*** 数组名作函数参数
+ c编译器将形参数组名作为指针变量处理,这也解释了为什么形参数组可以不指定元素个数.
  #+BEGIN_SRC c
  fun(int arr[])
  等价于
  fun(int * arr)
  #+END_SRC
+ 实参数组名固定为数组首元素地址,是指针常量,而形参数组名是一个指针变量
| 实参         | 形参         |
|--------------+--------------|
| 字符数组名   | 字符数组名   |
| 字符数组名   | 字符指针变量 |
| 字符指针变量 | 字符数组名   |
| 字符指针变量 | 字符指针变量 |
*** TODO 通过指针引用多维数组
*** 指针与数组的区别
1. 声明方式
   #+BEGIN_SRC c
   int a[];
   int * p;

   func(int a[]);
   func(int * p);
   #+END_SRC
2. 初始化方式
   #+BEGIN_SRC c
   int arr[]={1,2,3};
   int * arr={1,2,3};       //gcc warning
   例外
   char string[]="abcd";
   char * string="abcd";    //ok
   #+END_SRC
3. 编译时为数组分配若干存储单元,为指针变量分配一个存储单元
4. 数组名是指针常量,常量不能作左值.
   #+BEGIN_SRC c
   char a[10];
   char * p;

   a="abcd";     //error!! 数组名是指针常量
   p="abcd";
   #+END_SRC
5. 字符数组中的元素值是可以改变的,
   字符指针变量指向的字符串常量中的内容是不可以改变的
   #+BEGIN_SRC c
   char a[] = "abcd";
   a[0]='e';               //ok

   char * p = "abcd";      //指向字符串常量
   p[0]='f';               //error!!

   char a[] = "abcd";
   char * p = a;           //指向字符数组
   p[0]='f';               //ok
   #+END_SRC
** 通过指针引用字符串
*** 字符串的引用方式
可以用两种方法引用一个字符串
#+BEGIN_SRC c
字符数组
char string[]="abcd";

字符指针变量
char * string="abcd";     //string指向"abcd"的第一个字符'a'的地址
#+END_SRC
*** 字符指针变量与其他类型指针变量的区别
1. 初始化
   #+BEGIN_SRC c
   int arr[]={1,2,3};
   char string[]="abcd";

   int * arr={1,2,3};       //gcc warning
   char * string="abcd";    //ok
   #+END_SRC
2. 输出
   #+BEGIN_SRC c
   int * a;
   char * p;

   printf("%s\n",p);       //输出的是整个字符串的内容,直到遇到'\0'
   printf("%d\n",a);       //gcc warning
   printf("%s\n",a);       //gcc warning
   #+END_SRC
** 指向函数的指针
+ 编译系统为函数代码分配了存储空间,这段存储空间的起始地址(入口地址)称为这个函数的指针.
+ 定义指向函数的指针变量
  #+BEGIN_SRC c
  类型名 (* 指针变量名)(函数参数列表);
  #+END_SRC
+ 指针变量指向的函数的返回值,参数数量,类型,顺序必须和定义中的一致
+ 函数名与其代码段的入口地址一一对应,给函数指针变量赋值时,给出的是函数名(不带参数)
+ 用函数指针变量调用函数,只需用(*p)代替函数名即可
+ 举例
  #+BEGIN_SRC c
  int main()
  {
      int max(int,int);      //函数声明
      int (*p)(int,int);     //定义指向函数的指针变量p
      p=max;                 //使p指向max
      int a=1,b=2,c;
      c=(*p)(a,b);           //通过指针变量调用max函数
  }
  #+END_SRC
+ 函数指针变量的一个重要用途是把函数地址作为参数传递到其他函数
  #+BEGIN_SRC c
  void fun(int (* x1)(int), int (* x2)(int,int))
  {
    int a,b,i=3,j=5;
    a=(*x1)(i);
    b=(* x2)(i,j);
  }
  #+END_SRC
** 返回指针值的函数
一个函数可以返回整型值,字符值,实型值,也可以返回指针类型的数据
#+BEGIN_SRC c
类型名 * 函数名(参数列表);
#+END_SRC
#+BEGIN_EXAMPLE
区分
int  *a (int x, int y)
int (*a)(int x, int y)

第一种情况,a的两侧分别为*运算符和()运算符,()优先级高于*,
a先与()结合,表示a是函数,其返回值是指针

第二种情况,a先与*结合,表示p是一个指针,然后在与后面的()结合,
()表示是函数,即指针变量p指向函数
#+END_EXAMPLE
** 指针数组和多重指针
*** 指针数组
其元素均为指针类型数据的数组,称为指针数组
#+BEGIN_SRC c
类型名 * 数组名[数组长度];
#+END_SRC
#+BEGIN_SRC c
举例

char * name[] = {"hello","zoe","chao"};
#+END_SRC
#+BEGIN_EXAMPLE
区分

int  *p [4];
int (*p)[4];

第一种情况,[]比*优先级高,p先与[4]结合,p表示一个数组,
数组中元素的类型是指针类型

第二种情况,p首先与*结合,p表示一个指针,
[]表示数组,p指针变量指向的是一个数组
#+END_EXAMPLE
*** 指向指针的指针
#+BEGIN_SRC c
类型名 ** 指针变量名;

如
char **p;
*运算符是右结合性,因此**p相当于 *(*p),*p表示p是指针变量,指向char*类型的指针变量
#+END_SRC
#+BEGIN_SRC c
举例

int main()
{
    char * name[]={"hello","zoe","chao"};
    char **p;
    int i;
    for(i=0;i<3;i++)
    {
        p=name+i;
        printf("%s\n",*p);
    }
}
#+END_SRC
