html/c程序设计.html

<div id="outline-container-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> 数组名作函数参数</h4>
<div class="outline-text-4" id="text-6-2-4">

<ul>
<li>c编译器将形参数组名作为指针变量处理,这也解释了为什么形参数组可以不指定元素个数.



<pre class="src src-c">fun(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">arr</span>[])
<span style="color: #228b22;">&#31561;&#20215;&#20110;</span>
<span style="color: #0000ff;">fun</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">arr</span>)
</pre>

</li>
<li>实参数组名固定为数组首元素地址,是指针常量,而形参数组名是一个指针变量
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">实参</th><th scope="col" class="left">形参</th></tr>
</thead>
<tbody>
<tr><td class="left">字符数组名</td><td class="left">字符数组名</td></tr>
<tr><td class="left">字符数组名</td><td class="left">字符指针变量</td></tr>
<tr><td class="left">字符指针变量</td><td class="left">字符数组名</td></tr>
<tr><td class="left">字符指针变量</td><td class="left">字符指针变量</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-6-2-5" class="outline-4">
<h4 id="sec-6-2-5"><span class="section-number-4">6.2.5</span> <span class="todo TODO">TODO</span> 通过指针引用多维数组</h4>
<div class="outline-text-4" id="text-6-2-5">

</div>

</div>

<div id="outline-container-6-2-6" class="outline-4">
<h4 id="sec-6-2-6"><span class="section-number-4">6.2.6</span> 指针与数组的区别</h4>
<div class="outline-text-4" id="text-6-2-6">

<ol>
<li>声明方式



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[];
<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">p</span>;

func(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>[]);
func(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">p</span>);
</pre>

</li>
<li>初始化方式



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">arr</span>[]={1,2,3};
<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">arr</span>={1,2,3};       <span style="color: #b22222;">//</span><span style="color: #b22222;">gcc warning</span>
&#20363;&#22806;
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">string</span>[]=<span style="color: #8b2252;">"abcd"</span>;
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"abcd"</span>;    <span style="color: #b22222;">//</span><span style="color: #b22222;">ok</span>
</pre>

</li>
<li>编译时为数组分配若干存储单元,为指针变量分配一个存储单元
</li>
<li>数组名是指针常量,常量不能作左值.



<pre class="src src-c"><span style="color: #228b22;">char</span> <span style="color: #a0522d;">a</span>[10];
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">p</span>;

a=<span style="color: #8b2252;">"abcd"</span>;     <span style="color: #b22222;">//</span><span style="color: #b22222;">error!! &#25968;&#32452;&#21517;&#26159;&#25351;&#38024;&#24120;&#37327;</span>
p=<span style="color: #8b2252;">"abcd"</span>;
</pre>

</li>
<li>字符数组中的元素值是可以改变的,
   字符指针变量指向的字符串常量中的内容是不可以改变的



<pre class="src src-c"><span style="color: #228b22;">char</span> <span style="color: #a0522d;">a</span>[] = <span style="color: #8b2252;">"abcd"</span>;
a[0]=<span style="color: #8b2252;">'e'</span>;               <span style="color: #b22222;">//</span><span style="color: #b22222;">ok</span>

<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">p</span> = <span style="color: #8b2252;">"abcd"</span>;      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25351;&#21521;&#23383;&#31526;&#20018;&#24120;&#37327;</span>
p[0]=<span style="color: #8b2252;">'f'</span>;               <span style="color: #b22222;">//</span><span style="color: #b22222;">error!!</span>

<span style="color: #228b22;">char</span> <span style="color: #a0522d;">a</span>[] = <span style="color: #8b2252;">"abcd"</span>;
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">p</span> = a;           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25351;&#21521;&#23383;&#31526;&#25968;&#32452;</span>
p[0]=<span style="color: #8b2252;">'f'</span>;               <span style="color: #b22222;">//</span><span style="color: #b22222;">ok</span>
</pre>

</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 通过指针引用字符串</h3>
<div class="outline-text-3" id="text-6-3">


</div>

<div id="outline-container-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> 字符串的引用方式</h4>
<div class="outline-text-4" id="text-6-3-1">

<p>可以用两种方法引用一个字符串
</p>


<pre class="src src-c">&#23383;&#31526;&#25968;&#32452;
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">string</span>[]=<span style="color: #8b2252;">"abcd"</span>;

&#23383;&#31526;&#25351;&#38024;&#21464;&#37327;
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"abcd"</span>;     <span style="color: #b22222;">//</span><span style="color: #b22222;">string&#25351;&#21521;"abcd"&#30340;&#31532;&#19968;&#20010;&#23383;&#31526;'a'&#30340;&#22320;&#22336;</span>
</pre>

</div>

</div>

<div id="outline-container-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> 字符指针变量与其他类型指针变量的区别</h4>
<div class="outline-text-4" id="text-6-3-2">

<ol>
<li>初始化



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">arr</span>[]={1,2,3};
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">string</span>[]=<span style="color: #8b2252;">"abcd"</span>;

<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">arr</span>={1,2,3};       <span style="color: #b22222;">//</span><span style="color: #b22222;">gcc warning</span>
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"abcd"</span>;    <span style="color: #b22222;">//</span><span style="color: #b22222;">ok</span>
</pre>

</li>
<li>输出



<pre class="src src-c"><span style="color: #228b22;">int</span> * <span style="color: #a0522d;">a</span>;
<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">p</span>;

printf(<span style="color: #8b2252;">"%s\n"</span>,p);       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36755;&#20986;&#30340;&#26159;&#25972;&#20010;&#23383;&#31526;&#20018;&#30340;&#20869;&#23481;,&#30452;&#21040;&#36935;&#21040;'\0'</span>
printf(<span style="color: #8b2252;">"%d\n"</span>,a);       <span style="color: #b22222;">//</span><span style="color: #b22222;">gcc warning</span>
printf(<span style="color: #8b2252;">"%s\n"</span>,a);       <span style="color: #b22222;">//</span><span style="color: #b22222;">gcc warning</span>
</pre>

</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 指向函数的指针</h3>
<div class="outline-text-3" id="text-6-4">

<ul>
<li>编译系统为函数代码分配了存储空间,这段存储空间的起始地址(入口地址)称为这个函数的指针.
</li>
<li>定义指向函数的指针变量



<pre class="src src-c">&#31867;&#22411;&#21517; (* &#25351;&#38024;&#21464;&#37327;&#21517;)(&#20989;&#25968;&#21442;&#25968;&#21015;&#34920;);
</pre>

</li>
<li>指针变量指向的函数的返回值,参数数量,类型,顺序必须和定义中的一致
</li>
<li>函数名与其代码段的入口地址一一对应,给函数指针变量赋值时,给出的是函数名(不带参数)
</li>
<li>用函数指针变量调用函数,只需用(*p)代替函数名即可
</li>
<li>举例



<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">max</span>(<span style="color: #228b22;">int</span>,<span style="color: #228b22;">int</span>);      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20989;&#25968;&#22768;&#26126;</span>
    <span style="color: #228b22;">int</span> (*<span style="color: #a0522d;">p</span>)(<span style="color: #228b22;">int</span>,<span style="color: #228b22;">int</span>);     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;&#25351;&#21521;&#20989;&#25968;&#30340;&#25351;&#38024;&#21464;&#37327;p</span>
    p=max;                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20351;p&#25351;&#21521;max</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>=1,<span style="color: #a0522d;">b</span>=2,<span style="color: #a0522d;">c</span>;
    c=(*p)(a,b);           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36890;&#36807;&#25351;&#38024;&#21464;&#37327;&#35843;&#29992;max&#20989;&#25968;</span>
}
</pre>

</li>
<li>函数指针变量的一个重要用途是把函数地址作为参数传递到其他函数



<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">fun</span>(<span style="color: #228b22;">int</span> (* <span style="color: #a0522d;">x1</span>)(<span style="color: #228b22;">int</span>), <span style="color: #228b22;">int</span> (* <span style="color: #a0522d;">x2</span>)(<span style="color: #228b22;">int</span>,<span style="color: #228b22;">int</span>))
{
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>,<span style="color: #a0522d;">i</span>=3,<span style="color: #a0522d;">j</span>=5;
  a=(*x1)(i);
  b=(* x2)(i,j);
}
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 返回指针值的函数</h3>
<div class="outline-text-3" id="text-6-5">

<p>一个函数可以返回整型值,字符值,实型值,也可以返回指针类型的数据
</p>


<pre class="src src-c">&#31867;&#22411;&#21517; * &#20989;&#25968;&#21517;(&#21442;&#25968;&#21015;&#34920;);
</pre>


<pre class="example">区分
int  *a (int x, int y)
int (*a)(int x, int y)

第一种情况,a的两侧分别为*运算符和()运算符,()优先级高于*,
a先与()结合,表示a是函数,其返回值是指针

第二种情况,a先与*结合,表示p是一个指针,然后在与后面的()结合,
()表示是函数,即指针变量p指向函数
</pre>

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 指针数组和多重指针</h3>
<div class="outline-text-3" id="text-6-6">


</div>

<div id="outline-container-6-6-1" class="outline-4">
<h4 id="sec-6-6-1"><span class="section-number-4">6.6.1</span> 指针数组</h4>
<div class="outline-text-4" id="text-6-6-1">

<p>其元素均为指针类型数据的数组,称为指针数组
</p>


<pre class="src src-c">&#31867;&#22411;&#21517; * &#25968;&#32452;&#21517;[&#25968;&#32452;&#38271;&#24230;];
</pre>


<pre class="src src-c">&#20030;&#20363;

<span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>[] = {<span style="color: #8b2252;">"hello"</span>,<span style="color: #8b2252;">"zoe"</span>,<span style="color: #8b2252;">"chao"</span>};
</pre>


<pre class="example">区分

int  *p [4];
int (*p)[4];

第一种情况,[]比*优先级高,p先与[4]结合,p表示一个数组,
数组中元素的类型是指针类型

第二种情况,p首先与*结合,p表示一个指针,
[]表示数组,p指针变量指向的是一个数组
</pre>

</div>

</div>

<div id="outline-container-6-6-2" class="outline-4">
<h4 id="sec-6-6-2"><span class="section-number-4">6.6.2</span> 指向指针的指针</h4>
<div class="outline-text-4" id="text-6-6-2">




<pre class="src src-c"><span style="color: #228b22;">&#31867;&#22411;&#21517;</span> ** <span style="color: #a0522d;">&#25351;&#38024;&#21464;&#37327;&#21517;</span>;

&#22914;
<span style="color: #228b22;">char</span> **<span style="color: #a0522d;">p</span>;
*&#36816;&#31639;&#31526;&#26159;&#21491;&#32467;&#21512;&#24615;,&#22240;&#27492;**p&#30456;&#24403;&#20110; *(*p),*p&#34920;&#31034;p&#26159;&#25351;&#38024;&#21464;&#37327;,&#25351;&#21521;<span style="color: #228b22;">char</span>*&#31867;&#22411;&#30340;&#25351;&#38024;&#21464;&#37327;
</pre>


<pre class="src src-c">&#20030;&#20363;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>[]={<span style="color: #8b2252;">"hello"</span>,<span style="color: #8b2252;">"zoe"</span>,<span style="color: #8b2252;">"chao"</span>};
    <span style="color: #228b22;">char</span> **<span style="color: #a0522d;">p</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #a020f0;">for</span>(i=0;i&lt;3;i++)
    {
        p=name+i;
        printf(<span style="color: #8b2252;">"%s\n"</span>,*p);
    }
}
</pre>

</div>

</div>
