src/c程序设计.org
*** 指针数组作main函数的形参
#+BEGIN_SRC c
int main(int argc, char * argv[])

/*
argc表示参数的个数,argv是一个char*数组,其中每一个元素指向命令行中的一个字符串
注意参数包括命令本身
*/
#+END_SRC
** 动态内存分配
c语言允许动态内存分配,在需要时随时开辟,不需要时随时释放.
+ 自动变量分配在内存中的动态存储区,称为栈
+ 动态分配内存分配在内存中的自由存储区,称为堆
*** 建立内存动态分配
+ malloc
  #+BEGIN_SRC c
  void * malloc(unsigned int size);

  /*
  在内存的动态存储区中分配一个长度为size的连续空间.
  */
  #+END_SRC
+ calloc
  #+BEGIN_SRC c
  void * calloc(unsigned n, unsigned size);

  /*
  在内存的动态存储区中分配n个长度为size的连续空间
  用calloc可以为一维数组开辟动态存储空间
  */
  #+END_SRC
+ free
  #+BEGIN_SRC c
  void free(void * p);

  /*
  释放指针变量p所指向的动态空间,
  p应是最近一次调用calloc或malloc函数的返回值
  */
  #+END_SRC
+ realloc
  #+BEGIN_SRC c
  void realloc(void *p, unsigned int size);

  /*
  用realloc函数将p所指向的动态空间的大小改变为size
  p的值不变
  */
  #+END_SRC
*** void指针类型
c99允许使用基类型为void的指针类型
+ void指针类型不指向确定的类型
+ 将void指针赋值给另一指针变量时由系统对它进行类型转换

* 用户自己建立数据类型
** 定义和使用结构体变量
#+BEGIN_SRC c
struct 结构体名
{
    成员列表
};
#+END_SRC
#+BEGIN_SRC c
//举例

struct Student
{
    int num;
    char name[20];
    char sex;
    int age;
};
#+END_SRC
*** 定义结构体类型变量
1. 先声明结构体类型,再定义该类型的变量
   #+BEGIN_SRC c
   struct Student student1,student2;
   #+END_SRC
2. 在声明类型的同时定义变量
   #+BEGIN_SRC c
   struct 结构体名
   {
       成员列表
   } 变量名列表;
   #+END_SRC
   #+BEGIN_SRC c
   struct Student
   {
        int num;
        char name[20];
        char sex;
        int age;
   } student1,student2;
   #+END_SRC
3. 不指定类型名而直接定义结构体类型变量
   #+BEGIN_SRC c
   struct
   {
       成员列表
   } 变量名列表;
   #+END_SRC
*** 初始化和引用结构体变量
+ 在定义结构体变量时,可以对它初始化
  #+BEGIN_SRC c
  struct Student b={123,"zoe","m",25};
  
  //c99中允许对某一成员初始化
  struct Student b={.name="zoe"};
  /*
  其他未被指定初始化的数值类型成员被初始化为0,
  字符类型成员被初始化为'\0',
  指针类型成员被初始化为NULL
  */
  #+END_SRC
+ 可以引用结构体变量中的成员
  #+BEGIN_SRC c
  结构体变量名.成员名
  #+END_SRC
+ 对结构体变量的成员可以像普通变量一样进行各种运算
+ 同类结构体变量可以相互赋值
** 结构体数组
+ 结构体数组的每个元素都是一个结构体类型的数据
+ 定义结构体数组
  #+BEGIN_SRC c
  //1.
  struct 结构体名
  {
      成员列表
  }数组名[数组长度];

  //2. 先声明一个结构体类型
  结构体类型 数组名[数组长度];
  #+END_SRC
+ 初始化结构体数组
  #+BEGIN_SRC c
  结构体类型 数组名[数组长度] = {初值列表};
  #+END_SRC
  #+BEGIN_SRC c
  struct Person
  {
      char name[20];
      int count;
  }leader[3]={{"zoe",0},{"wch",0},{"ldy",0}};

  struct Person
  {
      char name[20];
      int count;
  }leader[3]={"zoe",0,"wch",0,"ldy",0};
  #+END_SRC
** 结构体指针
#+BEGIN_SRC c
struct Student * pt;
#+END_SRC
+ 结构体指针就是指向结构体变量的指针
+ 如果p指向一个结构体变量stu,以下3种用法等价
  1. stu.成员名
  2. (*p).成员名
  3. p->成员名
+ 将一个结构体变量的值传递给另一个函数,有3种方法
  1. 用结构体变量的成员作参数
  2. 用结构体变量作实参
     这种传递方式在空间和时间上开销较大
  3. 用指向结构体变量的指针作实参
