html/c程序设计.html

<div id="outline-container-6-6-3" class="outline-4">
<h4 id="sec-6-6-3"><span class="section-number-4">6.6.3</span> 指针数组作main函数的形参</h4>
<div class="outline-text-4" id="text-6-6-3">




<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">argv</span>[])

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">argc&#34920;&#31034;&#21442;&#25968;&#30340;&#20010;&#25968;,argv&#26159;&#19968;&#20010;char*&#25968;&#32452;,&#20854;&#20013;&#27599;&#19968;&#20010;&#20803;&#32032;&#25351;&#21521;&#21629;&#20196;&#34892;&#20013;&#30340;&#19968;&#20010;&#23383;&#31526;&#20018;</span>
<span style="color: #b22222;">&#27880;&#24847;&#21442;&#25968;&#21253;&#25324;&#21629;&#20196;&#26412;&#36523;</span>
<span style="color: #b22222;">*/</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> 动态内存分配</h3>
<div class="outline-text-3" id="text-6-7">

<p>c语言允许动态内存分配,在需要时随时开辟,不需要时随时释放.
</p><ul>
<li>自动变量分配在内存中的动态存储区,称为栈
</li>
<li>动态分配内存分配在内存中的自由存储区,称为堆
</li>
</ul>


</div>

<div id="outline-container-6-7-1" class="outline-4">
<h4 id="sec-6-7-1"><span class="section-number-4">6.7.1</span> 建立内存动态分配</h4>
<div class="outline-text-4" id="text-6-7-1">

<ul>
<li>malloc



<pre class="src src-c"><span style="color: #228b22;">void</span> * <span style="color: #0000ff;">malloc</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">size</span>);

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#22312;&#20869;&#23384;&#30340;&#21160;&#24577;&#23384;&#20648;&#21306;&#20013;&#20998;&#37197;&#19968;&#20010;&#38271;&#24230;&#20026;size&#30340;&#36830;&#32493;&#31354;&#38388;.</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>calloc



<pre class="src src-c"><span style="color: #228b22;">void</span> * <span style="color: #0000ff;">calloc</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">n</span>, <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">size</span>);

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#22312;&#20869;&#23384;&#30340;&#21160;&#24577;&#23384;&#20648;&#21306;&#20013;&#20998;&#37197;n&#20010;&#38271;&#24230;&#20026;size&#30340;&#36830;&#32493;&#31354;&#38388;</span>
<span style="color: #b22222;">&#29992;calloc&#21487;&#20197;&#20026;&#19968;&#32500;&#25968;&#32452;&#24320;&#36767;&#21160;&#24577;&#23384;&#20648;&#31354;&#38388;</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>free



<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">free</span>(<span style="color: #228b22;">void</span> * <span style="color: #a0522d;">p</span>);

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#37322;&#25918;&#25351;&#38024;&#21464;&#37327;p&#25152;&#25351;&#21521;&#30340;&#21160;&#24577;&#31354;&#38388;,</span>
<span style="color: #b22222;">p&#24212;&#26159;&#26368;&#36817;&#19968;&#27425;&#35843;&#29992;calloc&#25110;malloc&#20989;&#25968;&#30340;&#36820;&#22238;&#20540;</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>realloc



<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">realloc</span>(<span style="color: #228b22;">void</span> *<span style="color: #a0522d;">p</span>, <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">size</span>);

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#29992;realloc&#20989;&#25968;&#23558;p&#25152;&#25351;&#21521;&#30340;&#21160;&#24577;&#31354;&#38388;&#30340;&#22823;&#23567;&#25913;&#21464;&#20026;size</span>
<span style="color: #b22222;">p&#30340;&#20540;&#19981;&#21464;</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-7-2" class="outline-4">
<h4 id="sec-6-7-2"><span class="section-number-4">6.7.2</span> void指针类型</h4>
<div class="outline-text-4" id="text-6-7-2">

<p>c99允许使用基类型为void的指针类型
</p><ul>
<li>void指针类型不指向确定的类型
</li>
<li>将void指针赋值给另一指针变量时由系统对它进行类型转换
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 用户自己建立数据类型</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 定义和使用结构体变量</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">&#32467;&#26500;&#20307;&#21517;</span>
{
    &#25104;&#21592;&#21015;&#34920;
};
</pre>


<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#20030;&#20363;</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span>
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">num</span>;
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[20];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">sex</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">age</span>;
};
</pre>


</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> 定义结构体类型变量</h4>
<div class="outline-text-4" id="text-7-1-1">

<ol>
<li>先声明结构体类型,再定义该类型的变量



<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span> <span style="color: #a0522d;">student1</span>,<span style="color: #a0522d;">student2</span>;
</pre>

</li>
<li>在声明类型的同时定义变量



<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">&#32467;&#26500;&#20307;&#21517;</span>
{
    &#25104;&#21592;&#21015;&#34920;
} <span style="color: #a0522d;">&#21464;&#37327;&#21517;&#21015;&#34920;</span>;
</pre>


<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span>
{
     <span style="color: #228b22;">int</span> <span style="color: #a0522d;">num</span>;
     <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[20];
     <span style="color: #228b22;">char</span> <span style="color: #a0522d;">sex</span>;
     <span style="color: #228b22;">int</span> <span style="color: #a0522d;">age</span>;
} <span style="color: #a0522d;">student1</span>,<span style="color: #a0522d;">student2</span>;
</pre>

</li>
<li>不指定类型名而直接定义结构体类型变量



<pre class="src src-c"><span style="color: #a020f0;">struct</span>
{
    &#25104;&#21592;&#21015;&#34920;
} <span style="color: #a0522d;">&#21464;&#37327;&#21517;&#21015;&#34920;</span>;
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> 初始化和引用结构体变量</h4>
<div class="outline-text-4" id="text-7-1-2">

<ul>
<li>在定义结构体变量时,可以对它初始化



<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span> <span style="color: #a0522d;">b</span>={123,<span style="color: #8b2252;">"zoe"</span>,<span style="color: #8b2252;">"m"</span>,25};

<span style="color: #b22222;">//</span><span style="color: #b22222;">c99&#20013;&#20801;&#35768;&#23545;&#26576;&#19968;&#25104;&#21592;&#21021;&#22987;&#21270;</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span> <span style="color: #a0522d;">b</span>={.name=<span style="color: #8b2252;">"zoe"</span>};
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#20854;&#20182;&#26410;&#34987;&#25351;&#23450;&#21021;&#22987;&#21270;&#30340;&#25968;&#20540;&#31867;&#22411;&#25104;&#21592;&#34987;&#21021;&#22987;&#21270;&#20026;0,</span>
<span style="color: #b22222;">&#23383;&#31526;&#31867;&#22411;&#25104;&#21592;&#34987;&#21021;&#22987;&#21270;&#20026;'\0',</span>
<span style="color: #b22222;">&#25351;&#38024;&#31867;&#22411;&#25104;&#21592;&#34987;&#21021;&#22987;&#21270;&#20026;NULL</span>
<span style="color: #b22222;">*/</span>
</pre>

</li>
<li>可以引用结构体变量中的成员



<pre class="src src-c">&#32467;&#26500;&#20307;&#21464;&#37327;&#21517;.&#25104;&#21592;&#21517;
</pre>

</li>
<li>对结构体变量的成员可以像普通变量一样进行各种运算
</li>
<li>同类结构体变量可以相互赋值
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 结构体数组</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li>结构体数组的每个元素都是一个结构体类型的数据
</li>
<li>定义结构体数组



<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">1.</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">&#32467;&#26500;&#20307;&#21517;</span>
{
    &#25104;&#21592;&#21015;&#34920;
}<span style="color: #a0522d;">&#25968;&#32452;&#21517;</span>[&#25968;&#32452;&#38271;&#24230;];

<span style="color: #b22222;">//</span><span style="color: #b22222;">2. &#20808;&#22768;&#26126;&#19968;&#20010;&#32467;&#26500;&#20307;&#31867;&#22411;</span>
<span style="color: #228b22;">&#32467;&#26500;&#20307;&#31867;&#22411;</span> <span style="color: #a0522d;">&#25968;&#32452;&#21517;</span>[&#25968;&#32452;&#38271;&#24230;];
</pre>

</li>
<li>初始化结构体数组



<pre class="src src-c"><span style="color: #228b22;">&#32467;&#26500;&#20307;&#31867;&#22411;</span> <span style="color: #a0522d;">&#25968;&#32452;&#21517;</span>[&#25968;&#32452;&#38271;&#24230;] = {&#21021;&#20540;&#21015;&#34920;};
</pre>


<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Person</span>
{
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[20];
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count</span>;
}<span style="color: #a0522d;">leader</span>[3]={{<span style="color: #8b2252;">"zoe"</span>,0},{<span style="color: #8b2252;">"wch"</span>,0},{<span style="color: #8b2252;">"ldy"</span>,0}};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Person</span>
{
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[20];
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count</span>;
}<span style="color: #a0522d;">leader</span>[3]={<span style="color: #8b2252;">"zoe"</span>,0,<span style="color: #8b2252;">"wch"</span>,0,<span style="color: #8b2252;">"ldy"</span>,0};
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 结构体指针</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span> * <span style="color: #a0522d;">pt</span>;
</pre>

<ul>
<li>结构体指针就是指向结构体变量的指针
</li>
<li>如果p指向一个结构体变量stu,以下3种用法等价
<ol>
<li>stu.成员名
</li>
<li>(*p).成员名
</li>
<li>p-&gt;成员名
</li>
</ol>

</li>
<li>将一个结构体变量的值传递给另一个函数,有3种方法
<ol>
<li>用结构体变量的成员作参数
</li>
<li>用结构体变量作实参
     这种传递方式在空间和时间上开销较大
</li>
<li>用指向结构体变量的指针作实参
</li>
</ol>

</li>
</ul>

</div>

</div>
