src/c程序设计.org
** 共用体类型
+ 定义共用体类型
#+BEGIN_SRC c
union 共用体名
{
    成员列表
} 变量列表;
#+END_SRC
#+BEGIN_SRC c
//例子

//1.
union Data
{
    int i;
    char ch;
    float f;
}a,b,c;

//2. 已经定义了共用体类型那个
union Data a,b,c;

//3.
union
{
    int i;
    char ch;
    float f;
}a,b,c;
#+END_SRC
+ 引用共用体变量
#+BEGIN_SRC c
union Data a;
a.i = 16;
a.ch = 'a';
a.f =1.5;
#+END_SRC
+ 同一个内存段可以用来存放几种不同类型的成员,但在每一瞬时只能存放其中一个成员,而不是同时存放几个.
+ 共用体内存长度等于最长的成员的长度
+ 可以对共用体变量初始化,但初始化表中只能有一个常量
  #+BEGIN_SRC c
  union Data a = {16}
  union Data a = {16,'a',1.5};    //error!!
  union Data a = {.ch='j'};       //C99允许
  #+END_SRC
+ 共用体变量的地址和它的各成员的地址都是同一地址
  #+BEGIN_EXAMPLE
  &a.i, &a.c, &a.f都是同一值
  #+END_EXAMPLE
+ 不能对共用体变量名赋值,也不能企图引用变量名来得到一个值
  #+BEGIN_SRC c
  union Data a;
  a=1;              //error!!
  int m=a;          //error!!

  union Data b=a;   //C99允许同类型共用体变量互相赋值
  #+END_SRC
** 使用枚举类型
如果一个变量只有几种可能的值,则可以定义为枚举类型
#+BEGIN_SRC c
enum 枚举名 {枚举元素列表};
#+END_SRC
#+BEGIN_SRC c
//例子

//1.
enum Weekday{sun,mon,tue,wed,thu,fri,sat} workday,weekend;
workday=mon;      //workday和weekend是枚举变量,其值只能是定义的7个值之一
weekend=sun;

//2. 已经定义了枚举类型
enum Weekday workday,weekend;   

//3.
enum {sun,mon,tue,wed,thu,fri,sat} workday,weekend;
#+END_SRC
+ c编译器对枚举类型的枚举元素按常量处理,故称枚举常量
+ 每一个枚举元素都代表一个整数,c编译器按定义时的顺序默认其值是0,1,2,3...
+ 可以认为地指定枚举元素的数值
  #+BEGIN_SRC c
  enum Weekday{sun=7,mon=1,tue,wed,thu,fri,sat} workday,weekend;
  #+END_SRC
+ 枚举元素可用于判断比较
** 用typedef声明新类型名
+ 定义新类型名的方法是
  1. 按定义变量的方法写出定义体
  2. 将变量名换成新类型名
  3. 在最前面加typedef
+ 用typedef只是对已经存在的类型指定一个新的类型名,而没有创造新的类型.
#+BEGIN_SRC c
//命名一个新的类型名代表已有类型
typedef int Count;

//命名一个新的类型名代表结构体类型
typedef struct{
    int month;
    int day;
    int year;
}Date;

//命名一个新的类型名代表数组类型
typedef int Num[100];     //Num代表 int[100] 类型
Num a;                    //定义a为整形数组,它有100个元素

//命名一个新的类型名代表指针类型
typedef char* String;     //Sting代表 char* 类型
String p,s[10];           //定义p为字符指针变量,s为字符指针数组

//命名一个新的类型名代表指向函数的指针类型
typedef int (* Pointer)();      //Pointer代表指向函数的指针类型
Pointer p1,p2;                  //p1,p2为Pointer类型的指针变量
#+END_SRC

* 文件的输入输出
** c文件基础
*** 文件流
c对文件的存取是以字符(字节)为单位的,输入输出数据流的开始和结束仅受程序控制而
不受物理符号(如回车换行符)控制,这就增加了处理的灵活性,这种文件称为流式文件.
*** ASCII文件和二进制文件
数据文件可分为ASCII文件和二进制文件.
用ASCII码形式输出时字节与字符一一对应,一个字节代表一个字符,但占用存储空间较多,
而且要花费转换时间(二进制形式与ASCII码间的转换).
用二进制形式输出数值,可以节省外存空间和转换时间,把内存中的存储单元中的内容
原封不动地输出到磁盘上,此时一个字节并不一定代表一个字符,如果程序运行过程中有的
数据文件需要保存在外部介质上,以便在需要时再输入到内存,一般用二进制文件比较方便.
*** 文件缓冲区
ANSI C标准采用"缓冲文件系统"处理数据文件,缓冲文件系统是指系统自动地在内存区
为程序中每一个正在使用的文件开辟一个文件缓冲区.
从内存向磁盘输出数据必须先送到内存中的缓冲区,装满缓冲区后才一起送到磁盘去.
从磁盘向内存读入数据,则一次从磁盘文件将一批数据输入到内存缓冲区,然后再从缓冲区逐个地将数据送到程序数据区(给程序变量).
缓冲区大小由各个具体的c编译系统确定.
