html/c程序设计.html

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 共用体类型</h3>
<div class="outline-text-3" id="text-7-4">

<ul>
<li>定义共用体类型
</li>
</ul>




<pre class="src src-c"><span style="color: #a020f0;">union</span> <span style="color: #228b22;">&#20849;&#29992;&#20307;&#21517;</span>
{
    &#25104;&#21592;&#21015;&#34920;
} <span style="color: #a0522d;">&#21464;&#37327;&#21015;&#34920;</span>;
</pre>


<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#20363;&#23376;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">1.</span>
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span>
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">ch</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">f</span>;
}<span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>,<span style="color: #a0522d;">c</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">2. &#24050;&#32463;&#23450;&#20041;&#20102;&#20849;&#29992;&#20307;&#31867;&#22411;&#37027;&#20010;</span>
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>,<span style="color: #a0522d;">c</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">3.</span>
<span style="color: #a020f0;">union</span>
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">ch</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">f</span>;
}<span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>,<span style="color: #a0522d;">c</span>;
</pre>

<ul>
<li>引用共用体变量
</li>
</ul>




<pre class="src src-c"><span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span>;
a.i = 16;
a.ch = <span style="color: #8b2252;">'a'</span>;
a.f =1.5;
</pre>

<ul>
<li>同一个内存段可以用来存放几种不同类型的成员,但在每一瞬时只能存放其中一个成员,而不是同时存放几个.
</li>
<li>共用体内存长度等于最长的成员的长度
</li>
<li>可以对共用体变量初始化,但初始化表中只能有一个常量



<pre class="src src-c"><span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span> = {16}
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span> = {16,<span style="color: #8b2252;">'a'</span>,1.5};    <span style="color: #b22222;">//</span><span style="color: #b22222;">error!!</span>
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span> = {.ch=<span style="color: #8b2252;">'j'</span>};       <span style="color: #b22222;">//</span><span style="color: #b22222;">C99&#20801;&#35768;</span>
</pre>

</li>
<li>共用体变量的地址和它的各成员的地址都是同一地址



<pre class="example">&amp;a.i, &amp;a.c, &amp;a.f都是同一值
</pre>

</li>
<li>不能对共用体变量名赋值,也不能企图引用变量名来得到一个值



<pre class="src src-c"><span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">a</span>;
a=1;              <span style="color: #b22222;">//</span><span style="color: #b22222;">error!!</span>
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">m</span>=a;          <span style="color: #b22222;">//</span><span style="color: #b22222;">error!!</span>

<span style="color: #a020f0;">union</span> <span style="color: #228b22;">Data</span> <span style="color: #a0522d;">b</span>=a;   <span style="color: #b22222;">//</span><span style="color: #b22222;">C99&#20801;&#35768;&#21516;&#31867;&#22411;&#20849;&#29992;&#20307;&#21464;&#37327;&#20114;&#30456;&#36171;&#20540;</span>
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 使用枚举类型</h3>
<div class="outline-text-3" id="text-7-5">

<p>如果一个变量只有几种可能的值,则可以定义为枚举类型
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">&#26522;&#20030;&#21517;</span> {<span style="color: #a0522d;">&#26522;&#20030;&#20803;&#32032;&#21015;&#34920;</span>};
</pre>


<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#20363;&#23376;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">1.</span>
<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Weekday</span>{<span style="color: #a0522d;">sun</span>,<span style="color: #a0522d;">mon</span>,<span style="color: #a0522d;">tue</span>,<span style="color: #a0522d;">wed</span>,<span style="color: #a0522d;">thu</span>,<span style="color: #a0522d;">fri</span>,<span style="color: #a0522d;">sat</span>} <span style="color: #a0522d;">workday</span>,<span style="color: #a0522d;">weekend</span>;
workday=mon;      <span style="color: #b22222;">//</span><span style="color: #b22222;">workday&#21644;weekend&#26159;&#26522;&#20030;&#21464;&#37327;,&#20854;&#20540;&#21482;&#33021;&#26159;&#23450;&#20041;&#30340;7&#20010;&#20540;&#20043;&#19968;</span>
weekend=sun;

<span style="color: #b22222;">//</span><span style="color: #b22222;">2. &#24050;&#32463;&#23450;&#20041;&#20102;&#26522;&#20030;&#31867;&#22411;</span>
<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Weekday</span> <span style="color: #a0522d;">workday</span>,<span style="color: #a0522d;">weekend</span>;   

<span style="color: #b22222;">//</span><span style="color: #b22222;">3.</span>
<span style="color: #a020f0;">enum</span> {<span style="color: #a0522d;">sun</span>,<span style="color: #a0522d;">mon</span>,<span style="color: #a0522d;">tue</span>,<span style="color: #a0522d;">wed</span>,<span style="color: #a0522d;">thu</span>,<span style="color: #a0522d;">fri</span>,<span style="color: #a0522d;">sat</span>} <span style="color: #a0522d;">workday</span>,<span style="color: #a0522d;">weekend</span>;
</pre>

<ul>
<li>c编译器对枚举类型的枚举元素按常量处理,故称枚举常量
</li>
<li>每一个枚举元素都代表一个整数,c编译器按定义时的顺序默认其值是0,1,2,3&hellip;
</li>
<li>可以认为地指定枚举元素的数值



<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Weekday</span>{<span style="color: #a0522d;">sun</span>=7,<span style="color: #a0522d;">mon</span>=1,<span style="color: #a0522d;">tue</span>,<span style="color: #a0522d;">wed</span>,<span style="color: #a0522d;">thu</span>,<span style="color: #a0522d;">fri</span>,<span style="color: #a0522d;">sat</span>} <span style="color: #a0522d;">workday</span>,<span style="color: #a0522d;">weekend</span>;
</pre>

</li>
<li>枚举元素可用于判断比较
</li>
</ul>

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> 用typedef声明新类型名</h3>
<div class="outline-text-3" id="text-7-6">

<ul>
<li>定义新类型名的方法是
<ol>
<li>按定义变量的方法写出定义体
</li>
<li>将变量名换成新类型名
</li>
<li>在最前面加typedef
</li>
</ol>

</li>
<li>用typedef只是对已经存在的类型指定一个新的类型名,而没有创造新的类型.
</li>
</ul>




<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#21629;&#21517;&#19968;&#20010;&#26032;&#30340;&#31867;&#22411;&#21517;&#20195;&#34920;&#24050;&#26377;&#31867;&#22411;</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int</span> <span style="color: #228b22;">Count</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21629;&#21517;&#19968;&#20010;&#26032;&#30340;&#31867;&#22411;&#21517;&#20195;&#34920;&#32467;&#26500;&#20307;&#31867;&#22411;</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span>{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>;
}<span style="color: #228b22;">Date</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21629;&#21517;&#19968;&#20010;&#26032;&#30340;&#31867;&#22411;&#21517;&#20195;&#34920;&#25968;&#32452;&#31867;&#22411;</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int</span> <span style="color: #228b22;">Num</span>[100];     <span style="color: #b22222;">//</span><span style="color: #b22222;">Num&#20195;&#34920; int[100] &#31867;&#22411;</span>
<span style="color: #228b22;">Num</span> <span style="color: #a0522d;">a</span>;                    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;a&#20026;&#25972;&#24418;&#25968;&#32452;,&#23427;&#26377;100&#20010;&#20803;&#32032;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21629;&#21517;&#19968;&#20010;&#26032;&#30340;&#31867;&#22411;&#21517;&#20195;&#34920;&#25351;&#38024;&#31867;&#22411;</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">char</span>* <span style="color: #228b22;">String</span>;     <span style="color: #b22222;">//</span><span style="color: #b22222;">Sting&#20195;&#34920; char* &#31867;&#22411;</span>
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">p</span>,<span style="color: #a0522d;">s</span>[10];           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;p&#20026;&#23383;&#31526;&#25351;&#38024;&#21464;&#37327;,s&#20026;&#23383;&#31526;&#25351;&#38024;&#25968;&#32452;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21629;&#21517;&#19968;&#20010;&#26032;&#30340;&#31867;&#22411;&#21517;&#20195;&#34920;&#25351;&#21521;&#20989;&#25968;&#30340;&#25351;&#38024;&#31867;&#22411;</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int</span> (* <span style="color: #228b22;">Pointer</span>)();      <span style="color: #b22222;">//</span><span style="color: #b22222;">Pointer&#20195;&#34920;&#25351;&#21521;&#20989;&#25968;&#30340;&#25351;&#38024;&#31867;&#22411;</span>
<span style="color: #228b22;">Pointer</span> <span style="color: #a0522d;">p1</span>,<span style="color: #a0522d;">p2</span>;                  <span style="color: #b22222;">//</span><span style="color: #b22222;">p1,p2&#20026;Pointer&#31867;&#22411;&#30340;&#25351;&#38024;&#21464;&#37327;</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 文件的输入输出</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> c文件基础</h3>
<div class="outline-text-3" id="text-8-1">


</div>

<div id="outline-container-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> 文件流</h4>
<div class="outline-text-4" id="text-8-1-1">

<p>c对文件的存取是以字符(字节)为单位的,输入输出数据流的开始和结束仅受程序控制而
不受物理符号(如回车换行符)控制,这就增加了处理的灵活性,这种文件称为流式文件.
</p></div>

</div>

<div id="outline-container-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> ASCII文件和二进制文件</h4>
<div class="outline-text-4" id="text-8-1-2">

<p>数据文件可分为ASCII文件和二进制文件.
用ASCII码形式输出时字节与字符一一对应,一个字节代表一个字符,但占用存储空间较多,
而且要花费转换时间(二进制形式与ASCII码间的转换).
用二进制形式输出数值,可以节省外存空间和转换时间,把内存中的存储单元中的内容
原封不动地输出到磁盘上,此时一个字节并不一定代表一个字符,如果程序运行过程中有的
数据文件需要保存在外部介质上,以便在需要时再输入到内存,一般用二进制文件比较方便.
</p></div>

</div>

<div id="outline-container-8-1-3" class="outline-4">
<h4 id="sec-8-1-3"><span class="section-number-4">8.1.3</span> 文件缓冲区</h4>
<div class="outline-text-4" id="text-8-1-3">

<p>ANSI C标准采用"缓冲文件系统"处理数据文件,缓冲文件系统是指系统自动地在内存区
为程序中每一个正在使用的文件开辟一个文件缓冲区.
从内存向磁盘输出数据必须先送到内存中的缓冲区,装满缓冲区后才一起送到磁盘去.
从磁盘向内存读入数据,则一次从磁盘文件将一批数据输入到内存缓冲区,然后再从缓冲区逐个地将数据送到程序数据区(给程序变量).
缓冲区大小由各个具体的c编译系统确定.
</p></div>

</div>
