src/c程序设计.org
*** 文件类型指针
每个被使用的文件都在内存中开辟一个相应的 *文件信息区*,用来存放文件的有关信息(如文件名字,状态等).
这些信息保存在一个结构体变量中,如
#+BEGIN_SRC c
typedef struct
{
  short level;             //缓冲区满或空的程度
  unsigned flags;          //文件状态标志
  char fd;                 //文件描述符
  short bsize;             //缓冲区大小
  unsigned char* buffer;   //缓冲区位置
  unsigned char* curp;     //指针当前指向
  ...
}FILE;
#+END_SRC
每个FILE类型变量对应一个文件的信息区.
一般设置一个指向FILE类型变量的指针变量,通过它来引用这些FILE类型变量.
#+BEGIN_SRC c
FILE * fp;
#+END_SRC
** 打开与关闭文件
+ *打开文件* 是指为文件建立相应的信息区(用来存放有关文件的信息)和文件缓冲区(用来暂时存放输入输出的数据)
+ *关闭文件* 是指撤销文件信息区和文件缓冲区
+ fopen
  #+BEGIN_SRC c
  fopen(文件名,使用文件方式);
  
  //例子
  FILE * fp;
  fp=fopen("a1","r");
  #+END_SRC
  #+CAPTION: 使用文件的方式
  #+ATTR_HTML: border="2" rules="all" frame="all"
  | 方式 | 涵义                          | 如果指定文件不存在 |
  |------+-------------------------------+--------------------|
  | r    | 读,打开一个已存在文本文件     | 出错               |
  | w    | 写,打开一个文本文件           | 新建文件           |
  | a    | 写,向已存在文本文件追加       | 出错               |
  |------+-------------------------------+--------------------|
  | r+   | 读写,打开一个已存在文本文件   | 出错               |
  | w+   | 读写,打开一个文本文件         | 新建文件           |
  | a+   | 读写,打开一个已存在文本文件   | 出错               |
  |------+-------------------------------+--------------------|
  | rb   | 读,打开一个已存在二进制文件   | 出错               |
  | wb   | 写,打开一个二进制文件         | 新建文件           |
  | ab   | 写,向已存在二进制文件追加     | 出错               |
  |------+-------------------------------+--------------------|
  | rb+  | 读写,打开一个已存在二进制文件 | 出错               |
  | wb+  | 读写,打开一个二进制文件       | 新建文件           |
  | ab+  | 读写,打开一个已存在二进制文件 | 出错               |
  如果不能实现打开的任务,fopen将返回一个空指针NULL
  #+BEGIN_SRC c
  //打开文件常用方式
  if((fp=fopen("file1","r"))==NULL)
  {
    //错误处理
  }
  #+END_SRC
+ fclose
  #+BEGIN_SRC c
  fclose(文件指针);

  //例子
  fclose(fp);
  #+END_SRC
** 顺序读写数据文件
*** 读写字符
#+BEGIN_SRC c
fgetc(fp)     //从fp指向的文件读入一个字符
fputc(ch,fp)  //把字符ch写到文件指针变量fp所指向的文件中
#+END_SRC
*** 读写字符串
#+BEGIN_SRC c
fgets(str,n,fp)   //从fp指向的文件读入一个长度为(n-1)的字符串到字符数组str中
fputs(str,fp)     //把str所指向的字符串写到文件指针变量fp所指向的文件中
#+END_SRC
*** 用格式化方式读写文件
#+BEGIN_SRC c
fprintf(文件指针,格式字符串,输出列表);
fscanf(文件指针,格式字符串,输入列表);
#+END_SRC
*** 用二进制方式读写文件
fwrite向文件写一个数据块
#+BEGIN_SRC c
fread(buffer, size, count, fp);
fwrite(buffer, size, count, fp);

/*
buffer:
一个地址,
对fread来说是用来存放文件读入的数据的存储区的地址,
对fwrite来说,是要把此地址开始的存储区中的数据向文件输出

size: 要读写的字节数

count: 要读写多少个数据项(每个数据项长度为size)

fp:FILE类型指针
*/
#+END_SRC
#+BEGIN_SRC c
//例子

//假设arr是一个float类型数组名,
fread(arr, 4, 10, fp);  //从fp指向的文件中读入10个4字节数据,存储到数组arr中

//假设stu是有40个元素的struct Student类型变量
for(i=0;i<40;i++)
    fwrite(&stud[i],sizeof(struct Student),1,fp);
#+END_SRC
** 随机读写数据文件
+ 为了对读写进行控制,系统为每个文件设置了一个文件读写位置标记,用来指示"接下来要读写的下一个字符的位置"
+ 在对文件进行顺序读写时,文件位置标记指向文件开头,
  - 如果对文件进行读操作,文件位置标记向后移一个位置,直到遇到文件尾
  - 如果对文件进行写操作,则每写完一个数据,文件位置标记向后移一个位置
*** rewind
用rewind函数使文件位置标记指向文件开头
#+BEGIN_SRC c
rewind(fp)
#+END_SRC
*** fseek
用fseek函数改变文件位置标记
#+BEGIN_SRC c
fseek(文件类型指针, 位移量, 起始点)

/*
位移量是long型的,指以起始点为基点,向前移动的字节数
*/
#+END_SRC
#+CAPTION: 起始点
#+ATTR_HTML: border="2" rules="all" frame="all"
#+OPTIONS: ^:nil
| 起始点       | 名字     | 用数字代表 |
|--------------+----------+------------|
| 文件开始位置 | SEEK_SET | 0          |
| 文件当前位置 | SEEK_CUR | 1          |
| 文件末尾位置 | SEEK_END | 2          |
*** ftell
用ftell函数测定未见位置标记的当前位置
#+BEGIN_SRC c
long i;
i = ftell(fp);
#+END_SRC
** 文件读写出错检测
*** ferror
在调用各种输入输出函数时,如果出现错误,除了函数返回值有所反映外,还可以用ferror函数检查
#+BEGIN_SRC c
ferror(fp)
#+END_SRC
如果ferror返回值为0,表示未出错,如果返回非零值,表示出错.
