html/c程序设计.html

<div id="outline-container-8-1-4" class="outline-4">
<h4 id="sec-8-1-4"><span class="section-number-4">8.1.4</span> 文件类型指针</h4>
<div class="outline-text-4" id="text-8-1-4">

<p>每个被使用的文件都在内存中开辟一个相应的 <b>文件信息区</b>,用来存放文件的有关信息(如文件名字,状态等).
这些信息保存在一个结构体变量中,如
</p>


<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span>
{
  <span style="color: #228b22;">short</span> <span style="color: #a0522d;">level</span>;             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#32531;&#20914;&#21306;&#28385;&#25110;&#31354;&#30340;&#31243;&#24230;</span>
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">flags</span>;          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25991;&#20214;&#29366;&#24577;&#26631;&#24535;</span>
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">fd</span>;                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25991;&#20214;&#25551;&#36848;&#31526;</span>
  <span style="color: #228b22;">short</span> <span style="color: #a0522d;">bsize</span>;             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#32531;&#20914;&#21306;&#22823;&#23567;</span>
  <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">buffer</span>;   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#32531;&#20914;&#21306;&#20301;&#32622;</span>
  <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">curp</span>;     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25351;&#38024;&#24403;&#21069;&#25351;&#21521;</span>
  ...
}<span style="color: #228b22;">FILE</span>;
</pre>

<p>
每个FILE类型变量对应一个文件的信息区.
一般设置一个指向FILE类型变量的指针变量,通过它来引用这些FILE类型变量.
</p>


<pre class="src src-c"><span style="color: #228b22;">FILE</span> * <span style="color: #a0522d;">fp</span>;
</pre>

</div>
</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 打开与关闭文件</h3>
<div class="outline-text-3" id="text-8-2">

<ul>
<li><b>打开文件</b> 是指为文件建立相应的信息区(用来存放有关文件的信息)和文件缓冲区(用来暂时存放输入输出的数据)
</li>
<li><b>关闭文件</b> 是指撤销文件信息区和文件缓冲区
</li>
<li>fopen



<pre class="src src-c">fopen(&#25991;&#20214;&#21517;,&#20351;&#29992;&#25991;&#20214;&#26041;&#24335;);

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20363;&#23376;</span>
<span style="color: #228b22;">FILE</span> * <span style="color: #a0522d;">fp</span>;
fp=fopen(<span style="color: #8b2252;">"a1"</span>,<span style="color: #8b2252;">"r"</span>);
</pre>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">
<caption>使用文件的方式</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">方式</th><th scope="col" class="left">涵义</th><th scope="col" class="left">如果指定文件不存在</th></tr>
</thead>
<tbody>
<tr><td class="left">r</td><td class="left">读,打开一个已存在文本文件</td><td class="left">出错</td></tr>
<tr><td class="left">w</td><td class="left">写,打开一个文本文件</td><td class="left">新建文件</td></tr>
<tr><td class="left">a</td><td class="left">写,向已存在文本文件追加</td><td class="left">出错</td></tr>
</tbody>
<tbody>
<tr><td class="left">r+</td><td class="left">读写,打开一个已存在文本文件</td><td class="left">出错</td></tr>
<tr><td class="left">w+</td><td class="left">读写,打开一个文本文件</td><td class="left">新建文件</td></tr>
<tr><td class="left">a+</td><td class="left">读写,打开一个已存在文本文件</td><td class="left">出错</td></tr>
</tbody>
<tbody>
<tr><td class="left">rb</td><td class="left">读,打开一个已存在二进制文件</td><td class="left">出错</td></tr>
<tr><td class="left">wb</td><td class="left">写,打开一个二进制文件</td><td class="left">新建文件</td></tr>
<tr><td class="left">ab</td><td class="left">写,向已存在二进制文件追加</td><td class="left">出错</td></tr>
</tbody>
<tbody>
<tr><td class="left">rb+</td><td class="left">读写,打开一个已存在二进制文件</td><td class="left">出错</td></tr>
<tr><td class="left">wb+</td><td class="left">读写,打开一个二进制文件</td><td class="left">新建文件</td></tr>
<tr><td class="left">ab+</td><td class="left">读写,打开一个已存在二进制文件</td><td class="left">出错</td></tr>
</tbody>
</table>

  如果不能实现打开的任务,fopen将返回一个空指针NULL



<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#25171;&#24320;&#25991;&#20214;&#24120;&#29992;&#26041;&#24335;</span>
<span style="color: #a020f0;">if</span>((fp=fopen(<span style="color: #8b2252;">"file1"</span>,<span style="color: #8b2252;">"r"</span>))==<span style="color: #008b8b;">NULL</span>)
{
  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38169;&#35823;&#22788;&#29702;</span>
}
</pre>

</li>
<li>fclose



<pre class="src src-c">fclose(&#25991;&#20214;&#25351;&#38024;);

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20363;&#23376;</span>
fclose(fp);
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 顺序读写数据文件</h3>
<div class="outline-text-3" id="text-8-3">


</div>

<div id="outline-container-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> 读写字符</h4>
<div class="outline-text-4" id="text-8-3-1">




<pre class="src src-c">fgetc(fp)     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;fp&#25351;&#21521;&#30340;&#25991;&#20214;&#35835;&#20837;&#19968;&#20010;&#23383;&#31526;</span>
fputc(ch,fp)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25226;&#23383;&#31526;ch&#20889;&#21040;&#25991;&#20214;&#25351;&#38024;&#21464;&#37327;fp&#25152;&#25351;&#21521;&#30340;&#25991;&#20214;&#20013;</span>
</pre>

</div>

</div>

<div id="outline-container-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> 读写字符串</h4>
<div class="outline-text-4" id="text-8-3-2">




<pre class="src src-c">fgets(str,n,fp)   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;fp&#25351;&#21521;&#30340;&#25991;&#20214;&#35835;&#20837;&#19968;&#20010;&#38271;&#24230;&#20026;(n-1)&#30340;&#23383;&#31526;&#20018;&#21040;&#23383;&#31526;&#25968;&#32452;str&#20013;</span>
fputs(str,fp)     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25226;str&#25152;&#25351;&#21521;&#30340;&#23383;&#31526;&#20018;&#20889;&#21040;&#25991;&#20214;&#25351;&#38024;&#21464;&#37327;fp&#25152;&#25351;&#21521;&#30340;&#25991;&#20214;&#20013;</span>
</pre>

</div>

</div>

<div id="outline-container-8-3-3" class="outline-4">
<h4 id="sec-8-3-3"><span class="section-number-4">8.3.3</span> 用格式化方式读写文件</h4>
<div class="outline-text-4" id="text-8-3-3">




<pre class="src src-c">fprintf(&#25991;&#20214;&#25351;&#38024;,&#26684;&#24335;&#23383;&#31526;&#20018;,&#36755;&#20986;&#21015;&#34920;);
fscanf(&#25991;&#20214;&#25351;&#38024;,&#26684;&#24335;&#23383;&#31526;&#20018;,&#36755;&#20837;&#21015;&#34920;);
</pre>

</div>

</div>

<div id="outline-container-8-3-4" class="outline-4">
<h4 id="sec-8-3-4"><span class="section-number-4">8.3.4</span> 用二进制方式读写文件</h4>
<div class="outline-text-4" id="text-8-3-4">

<p>fwrite向文件写一个数据块
</p>


<pre class="src src-c">fread(buffer, size, count, fp);
fwrite(buffer, size, count, fp);

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">buffer:</span>
<span style="color: #b22222;">&#19968;&#20010;&#22320;&#22336;,</span>
<span style="color: #b22222;">&#23545;fread&#26469;&#35828;&#26159;&#29992;&#26469;&#23384;&#25918;&#25991;&#20214;&#35835;&#20837;&#30340;&#25968;&#25454;&#30340;&#23384;&#20648;&#21306;&#30340;&#22320;&#22336;,</span>
<span style="color: #b22222;">&#23545;fwrite&#26469;&#35828;,&#26159;&#35201;&#25226;&#27492;&#22320;&#22336;&#24320;&#22987;&#30340;&#23384;&#20648;&#21306;&#20013;&#30340;&#25968;&#25454;&#21521;&#25991;&#20214;&#36755;&#20986;</span>

<span style="color: #b22222;">size: &#35201;&#35835;&#20889;&#30340;&#23383;&#33410;&#25968;</span>

<span style="color: #b22222;">count: &#35201;&#35835;&#20889;&#22810;&#23569;&#20010;&#25968;&#25454;&#39033;(&#27599;&#20010;&#25968;&#25454;&#39033;&#38271;&#24230;&#20026;size)</span>

<span style="color: #b22222;">fp:FILE&#31867;&#22411;&#25351;&#38024;</span>
<span style="color: #b22222;">*/</span>
</pre>


<pre class="src src-c"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#20363;&#23376;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20551;&#35774;arr&#26159;&#19968;&#20010;float&#31867;&#22411;&#25968;&#32452;&#21517;,</span>
fread(arr, 4, 10, fp);  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;fp&#25351;&#21521;&#30340;&#25991;&#20214;&#20013;&#35835;&#20837;10&#20010;4&#23383;&#33410;&#25968;&#25454;,&#23384;&#20648;&#21040;&#25968;&#32452;arr&#20013;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20551;&#35774;stu&#26159;&#26377;40&#20010;&#20803;&#32032;&#30340;struct Student&#31867;&#22411;&#21464;&#37327;</span>
<span style="color: #a020f0;">for</span>(i=0;i&lt;40;i++)
    fwrite(&amp;stud[i],<span style="color: #a020f0;">sizeof</span>(<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Student</span>),1,fp);
</pre>

</div>
</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 随机读写数据文件</h3>
<div class="outline-text-3" id="text-8-4">

<ul>
<li>为了对读写进行控制,系统为每个文件设置了一个文件读写位置标记,用来指示"接下来要读写的下一个字符的位置"
</li>
<li>在对文件进行顺序读写时,文件位置标记指向文件开头,
<ul>
<li>如果对文件进行读操作,文件位置标记向后移一个位置,直到遇到文件尾
</li>
<li>如果对文件进行写操作,则每写完一个数据,文件位置标记向后移一个位置
</li>
</ul>

</li>
</ul>


</div>

<div id="outline-container-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> rewind</h4>
<div class="outline-text-4" id="text-8-4-1">

<p>用rewind函数使文件位置标记指向文件开头
</p>


<pre class="src src-c">rewind(fp)
</pre>

</div>

</div>

<div id="outline-container-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> fseek</h4>
<div class="outline-text-4" id="text-8-4-2">

<p>用fseek函数改变文件位置标记
</p>


<pre class="src src-c">fseek(&#25991;&#20214;&#31867;&#22411;&#25351;&#38024;, &#20301;&#31227;&#37327;, &#36215;&#22987;&#28857;)

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">&#20301;&#31227;&#37327;&#26159;long&#22411;&#30340;,&#25351;&#20197;&#36215;&#22987;&#28857;&#20026;&#22522;&#28857;,&#21521;&#21069;&#31227;&#21160;&#30340;&#23383;&#33410;&#25968;</span>
<span style="color: #b22222;">*/</span>
</pre>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">
<caption>起始点</caption>
<colgroup><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">起始点</th><th scope="col" class="left">名字</th><th scope="col" class="right">用数字代表</th></tr>
</thead>
<tbody>
<tr><td class="left">文件开始位置</td><td class="left">SEEK_SET</td><td class="right">0</td></tr>
<tr><td class="left">文件当前位置</td><td class="left">SEEK_CUR</td><td class="right">1</td></tr>
<tr><td class="left">文件末尾位置</td><td class="left">SEEK_END</td><td class="right">2</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-8-4-3" class="outline-4">
<h4 id="sec-8-4-3"><span class="section-number-4">8.4.3</span> ftell</h4>
<div class="outline-text-4" id="text-8-4-3">

<p>用ftell函数测定未见位置标记的当前位置
</p>


<pre class="src src-c"><span style="color: #228b22;">long</span> <span style="color: #a0522d;">i</span>;
i = ftell(fp);
</pre>

</div>
</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 文件读写出错检测</h3>
<div class="outline-text-3" id="text-8-5">


</div>

<div id="outline-container-8-5-1" class="outline-4">
<h4 id="sec-8-5-1"><span class="section-number-4">8.5.1</span> ferror</h4>
<div class="outline-text-4" id="text-8-5-1">

<p>在调用各种输入输出函数时,如果出现错误,除了函数返回值有所反映外,还可以用ferror函数检查
</p>


<pre class="src src-c">ferror(fp)
</pre>

<p>
如果ferror返回值为0,表示未出错,如果返回非零值,表示出错.
</p></div>

</div>
